[
    {
        "verse_number": "1",
        "text": "1Moses summoned all Israel and said:"
    },
    {
        "verse_number": "1",
        "text": "Hear, Israel, the decrees and laws I declare in your hearing today. Learn them and be sure to follow them."
    },
    {
        "verse_number": "2",
        "text": "2The Lord our God made a covenant with us at Horeb."
    },
    {
        "verse_number": "3",
        "text": "3It was not with our ancestors#5:3 Or not only with our parents that the Lord made this covenant, but with us, with all of us who are alive here today."
    },
    {
        "verse_number": "4",
        "text": "4The Lord spoke to you face to face out of the fire on the mountain."
    },
    {
        "verse_number": "5",
        "text": "5(At that time I stood between the Lord and you to declare to you the word of the Lord, because you were afraid of the fire and did not go up the mountain.) And he said:"
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6“I am the Lord your God, who brought you out of Egypt, out of the land of slavery."
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7“You shall have no other gods before#5:7 Or besides me."
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8“You shall not make for yourself an image in the form of anything in heaven above or on the earth beneath or in the waters below."
    },
    {
        "verse_number": "9",
        "text": "9You shall not bow down to them or worship them; for I, the Lord your God, am a jealous God, punishing the children for the sin of the parents to the third and fourth generation of those who hate me,"
    },
    {
        "verse_number": "10",
        "text": "10but showing love to a thousand generations of those who love me and keep my commandments."
    },
    {
        "verse_number": "10",
        "text": ""
    },
    {
        "verse_number": "11",
        "text": "11“You shall not misuse the name of the Lord your God, for the Lord will not hold anyone guiltless who misuses his name."
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12“Observe the Sabbath day by keeping it holy, as the Lord your God has commanded you."
    },
    {
        "verse_number": "13",
        "text": "13Six days you shall labor and do all your work,"
    },
    {
        "verse_number": "14",
        "text": "14but the seventh day is a sabbath to the Lord your God. On it you shall not do any work, neither you, nor your son or daughter, nor your male or female servant, nor your ox, your donkey or any of your animals, nor any foreigner residing in your towns, so that your male and female servants may rest, as you do."
    },
    {
        "verse_number": "15",
        "text": "15Remember that you were slaves in Egypt and that the Lord your God brought you out of there with a mighty hand and an outstretched arm. Therefore the Lord your God has commanded you to observe the Sabbath day."
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16“Honor your father and your mother, as the Lord your God has commanded you, so that you may live long and that it may go well with you in the land the Lord your God is giving you."
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17“You shall not murder."
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18“You shall not commit adultery."
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19“You shall not steal."
    },
    {
        "verse_number": "19",
        "text": ""
    },
    {
        "verse_number": "20",
        "text": "20“You shall not give false testimony against your neighbor."
    },
    {
        "verse_number": "20",
        "text": ""
    },
    {
        "verse_number": "21",
        "text": "21“You shall not covet your neighbor’s wife. You shall not set your desire on your neighbor’s house or land, his male or female servant, his ox or donkey, or anything that belongs to your neighbor.”"
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22These are the commandments the Lord proclaimed in a loud voice to your whole assembly there on the mountain from out of the fire, the cloud and the deep darkness; and he added nothing more. Then he wrote them on two stone tablets and gave them to me."
    },
    {
        "verse_number": "22",
        "text": ""
    },
    {
        "verse_number": "23",
        "text": "23When you heard the voice out of the darkness, while the mountain was ablaze with fire, all the leaders of your tribes and your elders came to me."
    },
    {
        "verse_number": "24",
        "text": "24And you said, “The Lord our God has shown us his glory and his majesty, and we have heard his voice from the fire. Today we have seen that a person can live even if God speaks with them."
    },
    {
        "verse_number": "25",
        "text": "25But now, why should we die? This great fire will consume us, and we will die if we hear the voice of the Lord our God any longer."
    },
    {
        "verse_number": "26",
        "text": "26For what mortal has ever heard the voice of the living God speaking out of fire, as we have, and survived?"
    },
    {
        "verse_number": "27",
        "text": "27Go near and listen to all that the Lord our God says. Then tell us whatever the Lord our God tells you. We will listen and obey.”"
    },
    {
        "verse_number": "27",
        "text": ""
    },
    {
        "verse_number": "28",
        "text": "28The Lord heard you when you spoke to me, and the Lord said to me, “I have heard what this people said to you. Everything they said was good."
    },
    {
        "verse_number": "29",
        "text": "29Oh, that their hearts would be inclined to fear me and keep all my commands always, so that it might go well with them and their children forever!"
    },
    {
        "verse_number": "29",
        "text": ""
    },
    {
        "verse_number": "30",
        "text": "30“Go, tell them to return to their tents."
    },
    {
        "verse_number": "31",
        "text": "31But you stay here with me so that I may give you all the commands, decrees and laws you are to teach them to follow in the land I am giving them to possess.”"
    },
    {
        "verse_number": "31",
        "text": ""
    },
    {
        "verse_number": "32",
        "text": "32So be careful to do what the Lord your God has commanded you; do not turn aside to the right or to the left."
    },
    {
        "verse_number": "33",
        "text": "33Walk in obedience to all that the Lord your God has commanded you, so that you may live and prosper and prolong your days in the land that you will possess."
    }
]