[
    {
        "verse_number": "1",
        "text": "1If you see your fellow Israelite’s ox or sheep straying, do not ignore it but be sure to take it back to its owner."
    },
    {
        "verse_number": "2",
        "text": "2If they do not live near you or if you do not know who owns it, take it home with you and keep it until they come looking for it. Then give it back."
    },
    {
        "verse_number": "3",
        "text": "3Do the same if you find their donkey or cloak or anything else they have lost. Do not ignore it."
    },
    {
        "verse_number": "3",
        "text": ""
    },
    {
        "verse_number": "4",
        "text": "4If you see your fellow Israelite’s donkey or ox fallen on the road, do not ignore it. Help the owner get it to its feet."
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5A woman must not wear men’s clothing, nor a man wear women’s clothing, for the Lord your God detests anyone who does this."
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6If you come across a bird’s nest beside the road, either in a tree or on the ground, and the mother is sitting on the young or on the eggs, do not take the mother with the young."
    },
    {
        "verse_number": "7",
        "text": "7You may take the young, but be sure to let the mother go, so that it may go well with you and you may have a long life."
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8When you build a new house, make a parapet around your roof so that you may not bring the guilt of bloodshed on your house if someone falls from the roof."
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9Do not plant two kinds of seed in your vineyard; if you do, not only the crops you plant but also the fruit of the vineyard will be defiled.#22:9 Or be forfeited to the sanctuary"
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10Do not plow with an ox and a donkey yoked together."
    },
    {
        "verse_number": "10",
        "text": ""
    },
    {
        "verse_number": "11",
        "text": "11Do not wear clothes of wool and linen woven together."
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12Make tassels on the four corners of the cloak you wear."
    },
    {
        "verse_number": "12",
        "text": ""
    },
    {
        "verse_number": "13",
        "text": "13If a man takes a wife and, after sleeping with her, dislikes her"
    },
    {
        "verse_number": "14",
        "text": "14and slanders her and gives her a bad name, saying, “I married this woman, but when I approached her, I did not find proof of her virginity,”"
    },
    {
        "verse_number": "15",
        "text": "15then the young woman’s father and mother shall bring to the town elders at the gate proof that she was a virgin."
    },
    {
        "verse_number": "16",
        "text": "16Her father will say to the elders, “I gave my daughter in marriage to this man, but he dislikes her."
    },
    {
        "verse_number": "17",
        "text": "17Now he has slandered her and said, ‘I did not find your daughter to be a virgin.’ But here is the proof of my daughter’s virginity.” Then her parents shall display the cloth before the elders of the town,"
    },
    {
        "verse_number": "18",
        "text": "18and the elders shall take the man and punish him."
    },
    {
        "verse_number": "19",
        "text": "19They shall fine him a hundred shekels#22:19 That is, about 2 1/2 pounds or about 1.2 kilograms of silver and give them to the young woman’s father, because this man has given an Israelite virgin a bad name. She shall continue to be his wife; he must not divorce her as long as he lives."
    },
    {
        "verse_number": "19",
        "text": ""
    },
    {
        "verse_number": "20",
        "text": "20If, however, the charge is true and no proof of the young woman’s virginity can be found,"
    },
    {
        "verse_number": "21",
        "text": "21she shall be brought to the door of her father’s house and there the men of her town shall stone her to death. She has done an outrageous thing in Israel by being promiscuous while still in her father’s house. You must purge the evil from among you."
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22If a man is found sleeping with another man’s wife, both the man who slept with her and the woman must die. You must purge the evil from Israel."
    },
    {
        "verse_number": "22",
        "text": ""
    },
    {
        "verse_number": "23",
        "text": "23If a man happens to meet in a town a virgin pledged to be married and he sleeps with her,"
    },
    {
        "verse_number": "24",
        "text": "24you shall take both of them to the gate of that town and stone them to death—the young woman because she was in a town and did not scream for help, and the man because he violated another man’s wife. You must purge the evil from among you."
    },
    {
        "verse_number": "24",
        "text": ""
    },
    {
        "verse_number": "25",
        "text": "25But if out in the country a man happens to meet a young woman pledged to be married and rapes her, only the man who has done this shall die."
    },
    {
        "verse_number": "26",
        "text": "26Do nothing to the woman; she has committed no sin deserving death. This case is like that of someone who attacks and murders a neighbor,"
    },
    {
        "verse_number": "27",
        "text": "27for the man found the young woman out in the country, and though the betrothed woman screamed, there was no one to rescue her."
    },
    {
        "verse_number": "27",
        "text": ""
    },
    {
        "verse_number": "28",
        "text": "28If a man happens to meet a virgin who is not pledged to be married and rapes her and they are discovered,"
    },
    {
        "verse_number": "29",
        "text": "29he shall pay her father fifty shekels#22:29 That is, about 1 1/4 pounds or about 575 grams of silver. He must marry the young woman, for he has violated her. He can never divorce her as long as he lives."
    },
    {
        "verse_number": "29",
        "text": ""
    },
    {
        "verse_number": "30",
        "text": "30A man is not to marry his father’s wife; he must not dishonor his father’s bed.#22:30 In Hebrew texts this verse (22:30) is numbered 23:1."
    }
]