[
    {
        "verse_number": "1",
        "text": "1If a man marries a woman who becomes displeasing to him because he finds something indecent about her, and he writes her a certificate of divorce, gives it to her and sends her from his house,"
    },
    {
        "verse_number": "2",
        "text": "2and if after she leaves his house she becomes the wife of another man,"
    },
    {
        "verse_number": "3",
        "text": "3and her second husband dislikes her and writes her a certificate of divorce, gives it to her and sends her from his house, or if he dies,"
    },
    {
        "verse_number": "4",
        "text": "4then her first husband, who divorced her, is not allowed to marry her again after she has been defiled. That would be detestable in the eyes of the Lord. Do not bring sin upon the land the Lord your God is giving you as an inheritance."
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5If a man has recently married, he must not be sent to war or have any other duty laid on him. For one year he is to be free to stay at home and bring happiness to the wife he has married."
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6Do not take a pair of millstones—not even the upper one—as security for a debt, because that would be taking a person’s livelihood as security."
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7If someone is caught kidnapping a fellow Israelite and treating or selling them as a slave, the kidnapper must die. You must purge the evil from among you."
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8In cases of defiling skin diseases,#24:8 The Hebrew word for defiling skin diseases, traditionally translated “leprosy,” was used for various diseases affecting the skin. be very careful to do exactly as the Levitical priests instruct you. You must follow carefully what I have commanded them."
    },
    {
        "verse_number": "9",
        "text": "9Remember what the Lord your God did to Miriam along the way after you came out of Egypt."
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10When you make a loan of any kind to your neighbor, do not go into their house to get what is offered to you as a pledge."
    },
    {
        "verse_number": "11",
        "text": "11Stay outside and let the neighbor to whom you are making the loan bring the pledge out to you."
    },
    {
        "verse_number": "12",
        "text": "12If the neighbor is poor, do not go to sleep with their pledge in your possession."
    },
    {
        "verse_number": "13",
        "text": "13Return their cloak by sunset so that your neighbor may sleep in it. Then they will thank you, and it will be regarded as a righteous act in the sight of the Lord your God."
    },
    {
        "verse_number": "13",
        "text": ""
    },
    {
        "verse_number": "14",
        "text": "14Do not take advantage of a hired worker who is poor and needy, whether that worker is a fellow Israelite or a foreigner residing in one of your towns."
    },
    {
        "verse_number": "15",
        "text": "15Pay them their wages each day before sunset, because they are poor and are counting on it. Otherwise they may cry to the Lord against you, and you will be guilty of sin."
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16Parents are not to be put to death for their children, nor children put to death for their parents; each will die for their own sin."
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17Do not deprive the foreigner or the fatherless of justice, or take the cloak of the widow as a pledge."
    },
    {
        "verse_number": "18",
        "text": "18Remember that you were slaves in Egypt and the Lord your God redeemed you from there. That is why I command you to do this."
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19When you are harvesting in your field and you overlook a sheaf, do not go back to get it. Leave it for the foreigner, the fatherless and the widow, so that the Lord your God may bless you in all the work of your hands."
    },
    {
        "verse_number": "20",
        "text": "20When you beat the olives from your trees, do not go over the branches a second time. Leave what remains for the foreigner, the fatherless and the widow."
    },
    {
        "verse_number": "21",
        "text": "21When you harvest the grapes in your vineyard, do not go over the vines again. Leave what remains for the foreigner, the fatherless and the widow."
    },
    {
        "verse_number": "22",
        "text": "22Remember that you were slaves in Egypt. That is why I command you to do this."
    }
]