[
    {
        "verse_number": "1",
        "text": "1This is the account of the family of Aaron and Moses at the time the Lord spoke to Moses at Mount Sinai."
    },
    {
        "verse_number": "1",
        "text": ""
    },
    {
        "verse_number": "2",
        "text": "2The names of the sons of Aaron were Nadab the firstborn and Abihu, Eleazar and Ithamar."
    },
    {
        "verse_number": "3",
        "text": "3Those were the names of Aaron’s sons, the anointed priests, who were ordained to serve as priests."
    },
    {
        "verse_number": "4",
        "text": "4Nadab and Abihu, however, died before the Lord when they made an offering with unauthorized fire before him in the Desert of Sinai. They had no sons, so Eleazar and Ithamar served as priests during the lifetime of their father Aaron."
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5The Lord said to Moses,"
    },
    {
        "verse_number": "6",
        "text": "6“Bring the tribe of Levi and present them to Aaron the priest to assist him."
    },
    {
        "verse_number": "7",
        "text": "7They are to perform duties for him and for the whole community at the tent of meeting by doing the work of the tabernacle."
    },
    {
        "verse_number": "8",
        "text": "8They are to take care of all the furnishings of the tent of meeting, fulfilling the obligations of the Israelites by doing the work of the tabernacle."
    },
    {
        "verse_number": "9",
        "text": "9Give the Levites to Aaron and his sons; they are the Israelites who are to be given wholly to him.#3:9 Most manuscripts of the Masoretic Text; some manuscripts of the Masoretic Text, Samaritan Pentateuch and Septuagint (see also 8:16) to me"
    },
    {
        "verse_number": "10",
        "text": "10Appoint Aaron and his sons to serve as priests; anyone else who approaches the sanctuary is to be put to death.”"
    },
    {
        "verse_number": "10",
        "text": ""
    },
    {
        "verse_number": "11",
        "text": "11The Lord also said to Moses,"
    },
    {
        "verse_number": "12",
        "text": "12“I have taken the Levites from among the Israelites in place of the first male offspring of every Israelite woman. The Levites are mine,"
    },
    {
        "verse_number": "13",
        "text": "13for all the firstborn are mine. When I struck down all the firstborn in Egypt, I set apart for myself every firstborn in Israel, whether human or animal. They are to be mine. I am the Lord.”"
    },
    {
        "verse_number": "13",
        "text": ""
    },
    {
        "verse_number": "14",
        "text": "14The Lord said to Moses in the Desert of Sinai,"
    },
    {
        "verse_number": "15",
        "text": "15“Count the Levites by their families and clans. Count every male a month old or more.”"
    },
    {
        "verse_number": "16",
        "text": "16So Moses counted them, as he was commanded by the word of the Lord."
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17These were the names of the sons of Levi:"
    },
    {
        "verse_number": "17",
        "text": "Gershon, Kohath and Merari."
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18These were the names of the Gershonite clans:"
    },
    {
        "verse_number": "18",
        "text": "Libni and Shimei."
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19The Kohathite clans:"
    },
    {
        "verse_number": "19",
        "text": "Amram, Izhar, Hebron and Uzziel."
    },
    {
        "verse_number": "19",
        "text": ""
    },
    {
        "verse_number": "20",
        "text": "20The Merarite clans:"
    },
    {
        "verse_number": "20",
        "text": "Mahli and Mushi."
    },
    {
        "verse_number": "20",
        "text": "These were the Levite clans, according to their families."
    },
    {
        "verse_number": "20",
        "text": ""
    },
    {
        "verse_number": "21",
        "text": "21To Gershon belonged the clans of the Libnites and Shimeites; these were the Gershonite clans."
    },
    {
        "verse_number": "22",
        "text": "22The number of all the males a month old or more who were counted was 7,500."
    },
    {
        "verse_number": "23",
        "text": "23The Gershonite clans were to camp on the west, behind the tabernacle."
    },
    {
        "verse_number": "24",
        "text": "24The leader of the families of the Gershonites was Eliasaph son of Lael."
    },
    {
        "verse_number": "25",
        "text": "25At the tent of meeting the Gershonites were responsible for the care of the tabernacle and tent, its coverings, the curtain at the entrance to the tent of meeting,"
    },
    {
        "verse_number": "26",
        "text": "26the curtains of the courtyard, the curtain at the entrance to the courtyard surrounding the tabernacle and altar, and the ropes—and everything related to their use."
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27To Kohath belonged the clans of the Amramites, Izharites, Hebronites and Uzzielites; these were the Kohathite clans."
    },
    {
        "verse_number": "28",
        "text": "28The number of all the males a month old or more was 8,600.#3:28 Hebrew; some Septuagint manuscripts 8,300 The Kohathites were responsible for the care of the sanctuary."
    },
    {
        "verse_number": "29",
        "text": "29The Kohathite clans were to camp on the south side of the tabernacle."
    },
    {
        "verse_number": "30",
        "text": "30The leader of the families of the Kohathite clans was Elizaphan son of Uzziel."
    },
    {
        "verse_number": "31",
        "text": "31They were responsible for the care of the ark, the table, the lampstand, the altars, the articles of the sanctuary used in ministering, the curtain, and everything related to their use."
    },
    {
        "verse_number": "32",
        "text": "32The chief leader of the Levites was Eleazar son of Aaron, the priest. He was appointed over those who were responsible for the care of the sanctuary."
    },
    {
        "verse_number": "32",
        "text": ""
    },
    {
        "verse_number": "33",
        "text": "33To Merari belonged the clans of the Mahlites and the Mushites; these were the Merarite clans."
    },
    {
        "verse_number": "34",
        "text": "34The number of all the males a month old or more who were counted was 6,200."
    },
    {
        "verse_number": "35",
        "text": "35The leader of the families of the Merarite clans was Zuriel son of Abihail; they were to camp on the north side of the tabernacle."
    },
    {
        "verse_number": "36",
        "text": "36The Merarites were appointed to take care of the frames of the tabernacle, its crossbars, posts, bases, all its equipment, and everything related to their use,"
    },
    {
        "verse_number": "37",
        "text": "37as well as the posts of the surrounding courtyard with their bases, tent pegs and ropes."
    },
    {
        "verse_number": "37",
        "text": ""
    },
    {
        "verse_number": "38",
        "text": "38Moses and Aaron and his sons were to camp to the east of the tabernacle, toward the sunrise, in front of the tent of meeting. They were responsible for the care of the sanctuary on behalf of the Israelites. Anyone else who approached the sanctuary was to be put to death."
    },
    {
        "verse_number": "38",
        "text": ""
    },
    {
        "verse_number": "39",
        "text": "39The total number of Levites counted at the Lord’s command by Moses and Aaron according to their clans, including every male a month old or more, was 22,000."
    },
    {
        "verse_number": "39",
        "text": ""
    },
    {
        "verse_number": "40",
        "text": "40The Lord said to Moses, “Count all the firstborn Israelite males who are a month old or more and make a list of their names."
    },
    {
        "verse_number": "41",
        "text": "41Take the Levites for me in place of all the firstborn of the Israelites, and the livestock of the Levites in place of all the firstborn of the livestock of the Israelites. I am the Lord.”"
    },
    {
        "verse_number": "41",
        "text": ""
    },
    {
        "verse_number": "42",
        "text": "42So Moses counted all the firstborn of the Israelites, as the Lord commanded him."
    },
    {
        "verse_number": "43",
        "text": "43The total number of firstborn males a month old or more, listed by name, was 22,273."
    },
    {
        "verse_number": "43",
        "text": ""
    },
    {
        "verse_number": "44",
        "text": "44The Lord also said to Moses,"
    },
    {
        "verse_number": "45",
        "text": "45“Take the Levites in place of all the firstborn of Israel, and the livestock of the Levites in place of their livestock. The Levites are to be mine. I am the Lord."
    },
    {
        "verse_number": "46",
        "text": "46To redeem the 273 firstborn Israelites who exceed the number of the Levites,"
    },
    {
        "verse_number": "47",
        "text": "47collect five shekels#3:47 That is, about 2 ounces or about 58 grams for each one, according to the sanctuary shekel, which weighs twenty gerahs."
    },
    {
        "verse_number": "48",
        "text": "48Give the money for the redemption of the additional Israelites to Aaron and his sons.”"
    },
    {
        "verse_number": "48",
        "text": ""
    },
    {
        "verse_number": "49",
        "text": "49So Moses collected the redemption money from those who exceeded the number redeemed by the Levites."
    },
    {
        "verse_number": "50",
        "text": "50From the firstborn of the Israelites he collected silver weighing 1,365 shekels,#3:50 That is, about 35 pounds or about 16 kilograms according to the sanctuary shekel."
    },
    {
        "verse_number": "51",
        "text": "51Moses gave the redemption money to Aaron and his sons, as he was commanded by the word of the Lord."
    }
]