[
    {
        "verse_number": "1",
        "text": "1Miriam and Aaron began to talk against Moses because of his Cushite wife, for he had married a Cushite."
    },
    {
        "verse_number": "2",
        "text": "2“Has the Lord spoken only through Moses?” they asked. “Hasn’t he also spoken through us?” And the Lord heard this."
    },
    {
        "verse_number": "2",
        "text": ""
    },
    {
        "verse_number": "3",
        "text": "3(Now Moses was a very humble man, more humble than anyone else on the face of the earth.)"
    },
    {
        "verse_number": "3",
        "text": ""
    },
    {
        "verse_number": "4",
        "text": "4At once the Lord said to Moses, Aaron and Miriam, “Come out to the tent of meeting, all three of you.” So the three of them went out."
    },
    {
        "verse_number": "5",
        "text": "5Then the Lord came down in a pillar of cloud; he stood at the entrance to the tent and summoned Aaron and Miriam. When the two of them stepped forward,"
    },
    {
        "verse_number": "6",
        "text": "6he said, “Listen to my words:"
    },
    {
        "verse_number": "6",
        "text": "“When there is a prophet among you,"
    },
    {
        "verse_number": "6",
        "text": "I, the Lord, reveal myself to them in visions,"
    },
    {
        "verse_number": "6",
        "text": "I speak to them in dreams."
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7But this is not true of my servant Moses;"
    },
    {
        "verse_number": "7",
        "text": "he is faithful in all my house."
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8With him I speak face to face,"
    },
    {
        "verse_number": "8",
        "text": "clearly and not in riddles;"
    },
    {
        "verse_number": "8",
        "text": "he sees the form of the Lord."
    },
    {
        "verse_number": "8",
        "text": "Why then were you not afraid"
    },
    {
        "verse_number": "8",
        "text": "to speak against my servant Moses?”"
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9The anger of the Lord burned against them, and he left them."
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10When the cloud lifted from above the tent, Miriam’s skin was leprous#12:10 The Hebrew for leprous was used for various diseases affecting the skin.—it became as white as snow. Aaron turned toward her and saw that she had a defiling skin disease,"
    },
    {
        "verse_number": "11",
        "text": "11and he said to Moses, “Please, my lord, I ask you not to hold against us the sin we have so foolishly committed."
    },
    {
        "verse_number": "12",
        "text": "12Do not let her be like a stillborn infant coming from its mother’s womb with its flesh half eaten away.”"
    },
    {
        "verse_number": "12",
        "text": ""
    },
    {
        "verse_number": "13",
        "text": "13So Moses cried out to the Lord, “Please, God, heal her!”"
    },
    {
        "verse_number": "13",
        "text": ""
    },
    {
        "verse_number": "14",
        "text": "14The Lord replied to Moses, “If her father had spit in her face, would she not have been in disgrace for seven days? Confine her outside the camp for seven days; after that she can be brought back.”"
    },
    {
        "verse_number": "15",
        "text": "15So Miriam was confined outside the camp for seven days, and the people did not move on till she was brought back."
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16After that, the people left Hazeroth and encamped in the Desert of Paran."
    }
]