[
    {
        "verse_number": "1",
        "text": "1“ ‘On the first day of the seventh month hold a sacred assembly and do no regular work. It is a day for you to sound the trumpets."
    },
    {
        "verse_number": "2",
        "text": "2As an aroma pleasing to the Lord, offer a burnt offering of one young bull, one ram and seven male lambs a year old, all without defect."
    },
    {
        "verse_number": "3",
        "text": "3With the bull offer a grain offering of three-tenths of an ephah#29:3 That is, probably about 11 pounds or about 5 kilograms; also in verses 9 and 14 of the finest flour mixed with olive oil; with the ram, two-tenths#29:3 That is, probably about 7 pounds or about 3.2 kilograms; also in verses 9 and 14;"
    },
    {
        "verse_number": "4",
        "text": "4and with each of the seven lambs, one-tenth.#29:4 That is, probably about 3 1/2 pounds or about 1.6 kilograms; also in verses 10 and 15"
    },
    {
        "verse_number": "5",
        "text": "5Include one male goat as a sin offering#29:5 Or purification offering; also elsewhere in this chapter to make atonement for you."
    },
    {
        "verse_number": "6",
        "text": "6These are in addition to the monthly and daily burnt offerings with their grain offerings and drink offerings as specified. They are food offerings presented to the Lord, a pleasing aroma."
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7“ ‘On the tenth day of this seventh month hold a sacred assembly. You must deny yourselves#29:7 Or must fast and do no work."
    },
    {
        "verse_number": "8",
        "text": "8Present as an aroma pleasing to the Lord a burnt offering of one young bull, one ram and seven male lambs a year old, all without defect."
    },
    {
        "verse_number": "9",
        "text": "9With the bull offer a grain offering of three-tenths of an ephah of the finest flour mixed with oil; with the ram, two-tenths;"
    },
    {
        "verse_number": "10",
        "text": "10and with each of the seven lambs, one-tenth."
    },
    {
        "verse_number": "11",
        "text": "11Include one male goat as a sin offering, in addition to the sin offering for atonement and the regular burnt offering with its grain offering, and their drink offerings."
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12“ ‘On the fifteenth day of the seventh month, hold a sacred assembly and do no regular work. Celebrate a festival to the Lord for seven days."
    },
    {
        "verse_number": "13",
        "text": "13Present as an aroma pleasing to the Lord a food offering consisting of a burnt offering of thirteen young bulls, two rams and fourteen male lambs a year old, all without defect."
    },
    {
        "verse_number": "14",
        "text": "14With each of the thirteen bulls offer a grain offering of three-tenths of an ephah of the finest flour mixed with oil; with each of the two rams, two-tenths;"
    },
    {
        "verse_number": "15",
        "text": "15and with each of the fourteen lambs, one-tenth."
    },
    {
        "verse_number": "16",
        "text": "16Include one male goat as a sin offering, in addition to the regular burnt offering with its grain offering and drink offering."
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17“ ‘On the second day offer twelve young bulls, two rams and fourteen male lambs a year old, all without defect."
    },
    {
        "verse_number": "18",
        "text": "18With the bulls, rams and lambs, offer their grain offerings and drink offerings according to the number specified."
    },
    {
        "verse_number": "19",
        "text": "19Include one male goat as a sin offering, in addition to the regular burnt offering with its grain offering, and their drink offerings."
    },
    {
        "verse_number": "19",
        "text": ""
    },
    {
        "verse_number": "20",
        "text": "20“ ‘On the third day offer eleven bulls, two rams and fourteen male lambs a year old, all without defect."
    },
    {
        "verse_number": "21",
        "text": "21With the bulls, rams and lambs, offer their grain offerings and drink offerings according to the number specified."
    },
    {
        "verse_number": "22",
        "text": "22Include one male goat as a sin offering, in addition to the regular burnt offering with its grain offering and drink offering."
    },
    {
        "verse_number": "22",
        "text": ""
    },
    {
        "verse_number": "23",
        "text": "23“ ‘On the fourth day offer ten bulls, two rams and fourteen male lambs a year old, all without defect."
    },
    {
        "verse_number": "24",
        "text": "24With the bulls, rams and lambs, offer their grain offerings and drink offerings according to the number specified."
    },
    {
        "verse_number": "25",
        "text": "25Include one male goat as a sin offering, in addition to the regular burnt offering with its grain offering and drink offering."
    },
    {
        "verse_number": "25",
        "text": ""
    },
    {
        "verse_number": "26",
        "text": "26“ ‘On the fifth day offer nine bulls, two rams and fourteen male lambs a year old, all without defect."
    },
    {
        "verse_number": "27",
        "text": "27With the bulls, rams and lambs, offer their grain offerings and drink offerings according to the number specified."
    },
    {
        "verse_number": "28",
        "text": "28Include one male goat as a sin offering, in addition to the regular burnt offering with its grain offering and drink offering."
    },
    {
        "verse_number": "28",
        "text": ""
    },
    {
        "verse_number": "29",
        "text": "29“ ‘On the sixth day offer eight bulls, two rams and fourteen male lambs a year old, all without defect."
    },
    {
        "verse_number": "30",
        "text": "30With the bulls, rams and lambs, offer their grain offerings and drink offerings according to the number specified."
    },
    {
        "verse_number": "31",
        "text": "31Include one male goat as a sin offering, in addition to the regular burnt offering with its grain offering and drink offering."
    },
    {
        "verse_number": "31",
        "text": ""
    },
    {
        "verse_number": "32",
        "text": "32“ ‘On the seventh day offer seven bulls, two rams and fourteen male lambs a year old, all without defect."
    },
    {
        "verse_number": "33",
        "text": "33With the bulls, rams and lambs, offer their grain offerings and drink offerings according to the number specified."
    },
    {
        "verse_number": "34",
        "text": "34Include one male goat as a sin offering, in addition to the regular burnt offering with its grain offering and drink offering."
    },
    {
        "verse_number": "34",
        "text": ""
    },
    {
        "verse_number": "35",
        "text": "35“ ‘On the eighth day hold a closing special assembly and do no regular work."
    },
    {
        "verse_number": "36",
        "text": "36Present as an aroma pleasing to the Lord a food offering consisting of a burnt offering of one bull, one ram and seven male lambs a year old, all without defect."
    },
    {
        "verse_number": "37",
        "text": "37With the bull, the ram and the lambs, offer their grain offerings and drink offerings according to the number specified."
    },
    {
        "verse_number": "38",
        "text": "38Include one male goat as a sin offering, in addition to the regular burnt offering with its grain offering and drink offering."
    },
    {
        "verse_number": "38",
        "text": ""
    },
    {
        "verse_number": "39",
        "text": "39“ ‘In addition to what you vow and your freewill offerings, offer these to the Lord at your appointed festivals: your burnt offerings, grain offerings, drink offerings and fellowship offerings.’ ”"
    },
    {
        "verse_number": "39",
        "text": ""
    },
    {
        "verse_number": "40",
        "text": "40Moses told the Israelites all that the Lord commanded him.#29:40 In Hebrew texts this verse (29:40) is numbered 30:1."
    }
]