[
    {
        "verse_number": "1",
        "text": "1When the Canaanite king of Arad, who lived in the Negev, heard that Israel was coming along the road to Atharim, he attacked the Israelites and captured some of them."
    },
    {
        "verse_number": "2",
        "text": "2Then Israel made this vow to the Lord: “If you will deliver these people into our hands, we will totally destroy#21:2 The Hebrew term refers to the irrevocable giving over of things or persons to the Lord, often by totally destroying them; also in verse 3. their cities.”"
    },
    {
        "verse_number": "3",
        "text": "3The Lord listened to Israel’s plea and gave the Canaanites over to them. They completely destroyed them and their towns; so the place was named Hormah.#21:3 Hormah means destruction."
    },
    {
        "verse_number": "3",
        "text": ""
    },
    {
        "verse_number": "4",
        "text": "4They traveled from Mount Hor along the route to the Red Sea,#21:4 Or the Sea of Reeds to go around Edom. But the people grew impatient on the way;"
    },
    {
        "verse_number": "5",
        "text": "5they spoke against God and against Moses, and said, “Why have you brought us up out of Egypt to die in the wilderness? There is no bread! There is no water! And we detest this miserable food!”"
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6Then the Lord sent venomous snakes among them; they bit the people and many Israelites died."
    },
    {
        "verse_number": "7",
        "text": "7The people came to Moses and said, “We sinned when we spoke against the Lord and against you. Pray that the Lord will take the snakes away from us.” So Moses prayed for the people."
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8The Lord said to Moses, “Make a snake and put it up on a pole; anyone who is bitten can look at it and live.”"
    },
    {
        "verse_number": "9",
        "text": "9So Moses made a bronze snake and put it up on a pole. Then when anyone was bitten by a snake and looked at the bronze snake, they lived."
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10The Israelites moved on and camped at Oboth."
    },
    {
        "verse_number": "11",
        "text": "11Then they set out from Oboth and camped in Iye Abarim, in the wilderness that faces Moab toward the sunrise."
    },
    {
        "verse_number": "12",
        "text": "12From there they moved on and camped in the Zered Valley."
    },
    {
        "verse_number": "13",
        "text": "13They set out from there and camped alongside the Arnon, which is in the wilderness extending into Amorite territory. The Arnon is the border of Moab, between Moab and the Amorites."
    },
    {
        "verse_number": "14",
        "text": "14That is why the Book of the Wars of the Lord says:"
    },
    {
        "verse_number": "14",
        "text": "“…Zahab#21:14 Septuagint; Hebrew Waheb in Suphah and the ravines,"
    },
    {
        "verse_number": "14",
        "text": "the Arnon"
    },
    {
        "verse_number": "15",
        "text": "15and#21:14,15 Or “I have been given from Suphah and the ravines / of the Arnon 15 to the slopes of the ravines"
    },
    {
        "verse_number": "15",
        "text": "that lead to the settlement of Ar"
    },
    {
        "verse_number": "15",
        "text": "and lie along the border of Moab.”"
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16From there they continued on to Beer, the well where the Lord said to Moses, “Gather the people together and I will give them water.”"
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17Then Israel sang this song:"
    },
    {
        "verse_number": "17",
        "text": "“Spring up, O well!"
    },
    {
        "verse_number": "17",
        "text": "Sing about it,"
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18about the well that the princes dug,"
    },
    {
        "verse_number": "18",
        "text": "that the nobles of the people sank—"
    },
    {
        "verse_number": "18",
        "text": "the nobles with scepters and staffs.”"
    },
    {
        "verse_number": "18",
        "text": "Then they went from the wilderness to Mattanah,"
    },
    {
        "verse_number": "19",
        "text": "19from Mattanah to Nahaliel, from Nahaliel to Bamoth,"
    },
    {
        "verse_number": "20",
        "text": "20and from Bamoth to the valley in Moab where the top of Pisgah overlooks the wasteland."
    },
    {
        "verse_number": "20",
        "text": ""
    },
    {
        "verse_number": "21",
        "text": "21Israel sent messengers to say to Sihon king of the Amorites:"
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22“Let us pass through your country. We will not turn aside into any field or vineyard, or drink water from any well. We will travel along the King’s Highway until we have passed through your territory.”"
    },
    {
        "verse_number": "22",
        "text": ""
    },
    {
        "verse_number": "23",
        "text": "23But Sihon would not let Israel pass through his territory. He mustered his entire army and marched out into the wilderness against Israel. When he reached Jahaz, he fought with Israel."
    },
    {
        "verse_number": "24",
        "text": "24Israel, however, put him to the sword and took over his land from the Arnon to the Jabbok, but only as far as the Ammonites, because their border was fortified."
    },
    {
        "verse_number": "25",
        "text": "25Israel captured all the cities of the Amorites and occupied them, including Heshbon and all its surrounding settlements."
    },
    {
        "verse_number": "26",
        "text": "26Heshbon was the city of Sihon king of the Amorites, who had fought against the former king of Moab and had taken from him all his land as far as the Arnon."
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27That is why the poets say:"
    },
    {
        "verse_number": "27",
        "text": "“Come to Heshbon and let it be rebuilt;"
    },
    {
        "verse_number": "27",
        "text": "let Sihon’s city be restored."
    },
    {
        "verse_number": "27",
        "text": ""
    },
    {
        "verse_number": "28",
        "text": "28“Fire went out from Heshbon,"
    },
    {
        "verse_number": "28",
        "text": "a blaze from the city of Sihon."
    },
    {
        "verse_number": "28",
        "text": "It consumed Ar of Moab,"
    },
    {
        "verse_number": "28",
        "text": "the citizens of Arnon’s heights."
    },
    {
        "verse_number": "28",
        "text": ""
    },
    {
        "verse_number": "29",
        "text": "29Woe to you, Moab!"
    },
    {
        "verse_number": "29",
        "text": "You are destroyed, people of Chemosh!"
    },
    {
        "verse_number": "29",
        "text": "He has given up his sons as fugitives"
    },
    {
        "verse_number": "29",
        "text": "and his daughters as captives"
    },
    {
        "verse_number": "29",
        "text": "to Sihon king of the Amorites."
    },
    {
        "verse_number": "29",
        "text": ""
    },
    {
        "verse_number": "30",
        "text": "30“But we have overthrown them;"
    },
    {
        "verse_number": "30",
        "text": "Heshbon’s dominion has been destroyed all the way to Dibon."
    },
    {
        "verse_number": "30",
        "text": "We have demolished them as far as Nophah,"
    },
    {
        "verse_number": "30",
        "text": "which extends to Medeba.”"
    },
    {
        "verse_number": "30",
        "text": ""
    },
    {
        "verse_number": "31",
        "text": "31So Israel settled in the land of the Amorites."
    },
    {
        "verse_number": "31",
        "text": ""
    },
    {
        "verse_number": "32",
        "text": "32After Moses had sent spies to Jazer, the Israelites captured its surrounding settlements and drove out the Amorites who were there."
    },
    {
        "verse_number": "33",
        "text": "33Then they turned and went up along the road toward Bashan, and Og king of Bashan and his whole army marched out to meet them in battle at Edrei."
    },
    {
        "verse_number": "33",
        "text": ""
    },
    {
        "verse_number": "34",
        "text": "34The Lord said to Moses, “Do not be afraid of him, for I have delivered him into your hands, along with his whole army and his land. Do to him what you did to Sihon king of the Amorites, who reigned in Heshbon.”"
    },
    {
        "verse_number": "34",
        "text": ""
    },
    {
        "verse_number": "35",
        "text": "35So they struck him down, together with his sons and his whole army, leaving them no survivors. And they took possession of his land."
    }
]