[
    {
        "verse_number": "1",
        "text": "1Now Jethro, the priest of Midian and father-in-law of Moses, heard of everything God had done for Moses and for his people Israel, and how the Lord had brought Israel out of Egypt."
    },
    {
        "verse_number": "1",
        "text": ""
    },
    {
        "verse_number": "2",
        "text": "2After Moses had sent away his wife Zipporah, his father-in-law Jethro received her"
    },
    {
        "verse_number": "3",
        "text": "3and her two sons. One son was named Gershom,#18:3 Gershom sounds like the Hebrew for a foreigner there. for Moses said, “I have become a foreigner in a foreign land”;"
    },
    {
        "verse_number": "4",
        "text": "4and the other was named Eliezer,#18:4 Eliezer means my God is helper. for he said, “My father’s God was my helper; he saved me from the sword of Pharaoh.”"
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5Jethro, Moses’ father-in-law, together with Moses’ sons and wife, came to him in the wilderness, where he was camped near the mountain of God."
    },
    {
        "verse_number": "6",
        "text": "6Jethro had sent word to him, “I, your father-in-law Jethro, am coming to you with your wife and her two sons.”"
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7So Moses went out to meet his father-in-law and bowed down and kissed him. They greeted each other and then went into the tent."
    },
    {
        "verse_number": "8",
        "text": "8Moses told his father-in-law about everything the Lord had done to Pharaoh and the Egyptians for Israel’s sake and about all the hardships they had met along the way and how the Lord had saved them."
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9Jethro was delighted to hear about all the good things the Lord had done for Israel in rescuing them from the hand of the Egyptians."
    },
    {
        "verse_number": "10",
        "text": "10He said, “Praise be to the Lord, who rescued you from the hand of the Egyptians and of Pharaoh, and who rescued the people from the hand of the Egyptians."
    },
    {
        "verse_number": "11",
        "text": "11Now I know that the Lord is greater than all other gods, for he did this to those who had treated Israel arrogantly.”"
    },
    {
        "verse_number": "12",
        "text": "12Then Jethro, Moses’ father-in-law, brought a burnt offering and other sacrifices to God, and Aaron came with all the elders of Israel to eat a meal with Moses’ father-in-law in the presence of God."
    },
    {
        "verse_number": "12",
        "text": ""
    },
    {
        "verse_number": "13",
        "text": "13The next day Moses took his seat to serve as judge for the people, and they stood around him from morning till evening."
    },
    {
        "verse_number": "14",
        "text": "14When his father-in-law saw all that Moses was doing for the people, he said, “What is this you are doing for the people? Why do you alone sit as judge, while all these people stand around you from morning till evening?”"
    },
    {
        "verse_number": "14",
        "text": ""
    },
    {
        "verse_number": "15",
        "text": "15Moses answered him, “Because the people come to me to seek God’s will."
    },
    {
        "verse_number": "16",
        "text": "16Whenever they have a dispute, it is brought to me, and I decide between the parties and inform them of God’s decrees and instructions.”"
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17Moses’ father-in-law replied, “What you are doing is not good."
    },
    {
        "verse_number": "18",
        "text": "18You and these people who come to you will only wear yourselves out. The work is too heavy for you; you cannot handle it alone."
    },
    {
        "verse_number": "19",
        "text": "19Listen now to me and I will give you some advice, and may God be with you. You must be the people’s representative before God and bring their disputes to him."
    },
    {
        "verse_number": "20",
        "text": "20Teach them his decrees and instructions, and show them the way they are to live and how they are to behave."
    },
    {
        "verse_number": "21",
        "text": "21But select capable men from all the people—men who fear God, trustworthy men who hate dishonest gain—and appoint them as officials over thousands, hundreds, fifties and tens."
    },
    {
        "verse_number": "22",
        "text": "22Have them serve as judges for the people at all times, but have them bring every difficult case to you; the simple cases they can decide themselves. That will make your load lighter, because they will share it with you."
    },
    {
        "verse_number": "23",
        "text": "23If you do this and God so commands, you will be able to stand the strain, and all these people will go home satisfied.”"
    },
    {
        "verse_number": "23",
        "text": ""
    },
    {
        "verse_number": "24",
        "text": "24Moses listened to his father-in-law and did everything he said."
    },
    {
        "verse_number": "25",
        "text": "25He chose capable men from all Israel and made them leaders of the people, officials over thousands, hundreds, fifties and tens."
    },
    {
        "verse_number": "26",
        "text": "26They served as judges for the people at all times. The difficult cases they brought to Moses, but the simple ones they decided themselves."
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27Then Moses sent his father-in-law on his way, and Jethro returned to his own country."
    }
]