[
    {
        "verse_number": "1",
        "text": "1Then the Lord said to Moses, “Go to Pharaoh and say to him, ‘This is what the Lord says: Let my people go, so that they may worship me."
    },
    {
        "verse_number": "2",
        "text": "2If you refuse to let them go, I will send a plague of frogs on your whole country."
    },
    {
        "verse_number": "3",
        "text": "3The Nile will teem with frogs. They will come up into your palace and your bedroom and onto your bed, into the houses of your officials and on your people, and into your ovens and kneading troughs."
    },
    {
        "verse_number": "4",
        "text": "4The frogs will come up on you and your people and all your officials.’ ”"
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5Then the Lord said to Moses, “Tell Aaron, ‘Stretch out your hand with your staff over the streams and canals and ponds, and make frogs come up on the land of Egypt.’ ”"
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6So Aaron stretched out his hand over the waters of Egypt, and the frogs came up and covered the land."
    },
    {
        "verse_number": "7",
        "text": "7But the magicians did the same things by their secret arts; they also made frogs come up on the land of Egypt."
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8Pharaoh summoned Moses and Aaron and said, “Pray to the Lord to take the frogs away from me and my people, and I will let your people go to offer sacrifices to the Lord.”"
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9Moses said to Pharaoh, “I leave to you the honor of setting the time for me to pray for you and your officials and your people that you and your houses may be rid of the frogs, except for those that remain in the Nile.”"
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10“Tomorrow,” Pharaoh said."
    },
    {
        "verse_number": "10",
        "text": "Moses replied, “It will be as you say, so that you may know there is no one like the Lord our God."
    },
    {
        "verse_number": "11",
        "text": "11The frogs will leave you and your houses, your officials and your people; they will remain only in the Nile.”"
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12After Moses and Aaron left Pharaoh, Moses cried out to the Lord about the frogs he had brought on Pharaoh."
    },
    {
        "verse_number": "13",
        "text": "13And the Lord did what Moses asked. The frogs died in the houses, in the courtyards and in the fields."
    },
    {
        "verse_number": "14",
        "text": "14They were piled into heaps, and the land reeked of them."
    },
    {
        "verse_number": "15",
        "text": "15But when Pharaoh saw that there was relief, he hardened his heart and would not listen to Moses and Aaron, just as the Lord had said."
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16Then the Lord said to Moses, “Tell Aaron, ‘Stretch out your staff and strike the dust of the ground,’ and throughout the land of Egypt the dust will become gnats.”"
    },
    {
        "verse_number": "17",
        "text": "17They did this, and when Aaron stretched out his hand with the staff and struck the dust of the ground, gnats came on people and animals. All the dust throughout the land of Egypt became gnats."
    },
    {
        "verse_number": "18",
        "text": "18But when the magicians tried to produce gnats by their secret arts, they could not."
    },
    {
        "verse_number": "18",
        "text": "Since the gnats were on people and animals everywhere,"
    },
    {
        "verse_number": "19",
        "text": "19the magicians said to Pharaoh, “This is the finger of God.” But Pharaoh’s heart was hard and he would not listen, just as the Lord had said."
    },
    {
        "verse_number": "19",
        "text": ""
    },
    {
        "verse_number": "20",
        "text": "20Then the Lord said to Moses, “Get up early in the morning and confront Pharaoh as he goes to the river and say to him, ‘This is what the Lord says: Let my people go, so that they may worship me."
    },
    {
        "verse_number": "21",
        "text": "21If you do not let my people go, I will send swarms of flies on you and your officials, on your people and into your houses. The houses of the Egyptians will be full of flies; even the ground will be covered with them."
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22“ ‘But on that day I will deal differently with the land of Goshen, where my people live; no swarms of flies will be there, so that you will know that I, the Lord, am in this land."
    },
    {
        "verse_number": "23",
        "text": "23I will make a distinction#8:23 Septuagint and Vulgate; Hebrew will put a deliverance between my people and your people. This sign will occur tomorrow.’ ”"
    },
    {
        "verse_number": "23",
        "text": ""
    },
    {
        "verse_number": "24",
        "text": "24And the Lord did this. Dense swarms of flies poured into Pharaoh’s palace and into the houses of his officials; throughout Egypt the land was ruined by the flies."
    },
    {
        "verse_number": "24",
        "text": ""
    },
    {
        "verse_number": "25",
        "text": "25Then Pharaoh summoned Moses and Aaron and said, “Go, sacrifice to your God here in the land.”"
    },
    {
        "verse_number": "25",
        "text": ""
    },
    {
        "verse_number": "26",
        "text": "26But Moses said, “That would not be right. The sacrifices we offer the Lord our God would be detestable to the Egyptians. And if we offer sacrifices that are detestable in their eyes, will they not stone us?"
    },
    {
        "verse_number": "27",
        "text": "27We must take a three-day journey into the wilderness to offer sacrifices to the Lord our God, as he commands us.”"
    },
    {
        "verse_number": "27",
        "text": ""
    },
    {
        "verse_number": "28",
        "text": "28Pharaoh said, “I will let you go to offer sacrifices to the Lord your God in the wilderness, but you must not go very far. Now pray for me.”"
    },
    {
        "verse_number": "28",
        "text": ""
    },
    {
        "verse_number": "29",
        "text": "29Moses answered, “As soon as I leave you, I will pray to the Lord, and tomorrow the flies will leave Pharaoh and his officials and his people. Only let Pharaoh be sure that he does not act deceitfully again by not letting the people go to offer sacrifices to the Lord.”"
    },
    {
        "verse_number": "29",
        "text": ""
    },
    {
        "verse_number": "30",
        "text": "30Then Moses left Pharaoh and prayed to the Lord,"
    },
    {
        "verse_number": "31",
        "text": "31and the Lord did what Moses asked. The flies left Pharaoh and his officials and his people; not a fly remained."
    },
    {
        "verse_number": "32",
        "text": "32But this time also Pharaoh hardened his heart and would not let the people go."
    }
]