[
    {
        "verse_number": "1",
        "text": "1When the people saw that Moses was so long in coming down from the mountain, they gathered around Aaron and said, “Come, make us gods#32:1 Or a god; also in verses 23 and 31 who will go before us. As for this fellow Moses who brought us up out of Egypt, we don’t know what has happened to him.”"
    },
    {
        "verse_number": "1",
        "text": ""
    },
    {
        "verse_number": "2",
        "text": "2Aaron answered them, “Take off the gold earrings that your wives, your sons and your daughters are wearing, and bring them to me.”"
    },
    {
        "verse_number": "3",
        "text": "3So all the people took off their earrings and brought them to Aaron."
    },
    {
        "verse_number": "4",
        "text": "4He took what they handed him and made it into an idol cast in the shape of a calf, fashioning it with a tool. Then they said, “These are your gods,#32:4 Or This is your god; also in verse 8 Israel, who brought you up out of Egypt.”"
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5When Aaron saw this, he built an altar in front of the calf and announced, “Tomorrow there will be a festival to the Lord.”"
    },
    {
        "verse_number": "6",
        "text": "6So the next day the people rose early and sacrificed burnt offerings and presented fellowship offerings. Afterward they sat down to eat and drink and got up to indulge in revelry."
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7Then the Lord said to Moses, “Go down, because your people, whom you brought up out of Egypt, have become corrupt."
    },
    {
        "verse_number": "8",
        "text": "8They have been quick to turn away from what I commanded them and have made themselves an idol cast in the shape of a calf. They have bowed down to it and sacrificed to it and have said, ‘These are your gods, Israel, who brought you up out of Egypt.’"
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9“I have seen these people,” the Lord said to Moses, “and they are a stiff-necked people."
    },
    {
        "verse_number": "10",
        "text": "10Now leave me alone so that my anger may burn against them and that I may destroy them. Then I will make you into a great nation.”"
    },
    {
        "verse_number": "10",
        "text": ""
    },
    {
        "verse_number": "11",
        "text": "11But Moses sought the favor of the Lord his God. “Lord,” he said, “why should your anger burn against your people, whom you brought out of Egypt with great power and a mighty hand?"
    },
    {
        "verse_number": "12",
        "text": "12Why should the Egyptians say, ‘It was with evil intent that he brought them out, to kill them in the mountains and to wipe them off the face of the earth’? Turn from your fierce anger; relent and do not bring disaster on your people."
    },
    {
        "verse_number": "13",
        "text": "13Remember your servants Abraham, Isaac and Israel, to whom you swore by your own self: ‘I will make your descendants as numerous as the stars in the sky and I will give your descendants all this land I promised them, and it will be their inheritance forever.’ ”"
    },
    {
        "verse_number": "14",
        "text": "14Then the Lord relented and did not bring on his people the disaster he had threatened."
    },
    {
        "verse_number": "14",
        "text": ""
    },
    {
        "verse_number": "15",
        "text": "15Moses turned and went down the mountain with the two tablets of the covenant law in his hands. They were inscribed on both sides, front and back."
    },
    {
        "verse_number": "16",
        "text": "16The tablets were the work of God; the writing was the writing of God, engraved on the tablets."
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17When Joshua heard the noise of the people shouting, he said to Moses, “There is the sound of war in the camp.”"
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18Moses replied:"
    },
    {
        "verse_number": "18",
        "text": "“It is not the sound of victory,"
    },
    {
        "verse_number": "18",
        "text": "it is not the sound of defeat;"
    },
    {
        "verse_number": "18",
        "text": "it is the sound of singing that I hear.”"
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19When Moses approached the camp and saw the calf and the dancing, his anger burned and he threw the tablets out of his hands, breaking them to pieces at the foot of the mountain."
    },
    {
        "verse_number": "20",
        "text": "20And he took the calf the people had made and burned it in the fire; then he ground it to powder, scattered it on the water and made the Israelites drink it."
    },
    {
        "verse_number": "20",
        "text": ""
    },
    {
        "verse_number": "21",
        "text": "21He said to Aaron, “What did these people do to you, that you led them into such great sin?”"
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22“Do not be angry, my lord,” Aaron answered. “You know how prone these people are to evil."
    },
    {
        "verse_number": "23",
        "text": "23They said to me, ‘Make us gods who will go before us. As for this fellow Moses who brought us up out of Egypt, we don’t know what has happened to him.’"
    },
    {
        "verse_number": "24",
        "text": "24So I told them, ‘Whoever has any gold jewelry, take it off.’ Then they gave me the gold, and I threw it into the fire, and out came this calf!”"
    },
    {
        "verse_number": "24",
        "text": ""
    },
    {
        "verse_number": "25",
        "text": "25Moses saw that the people were running wild and that Aaron had let them get out of control and so become a laughingstock to their enemies."
    },
    {
        "verse_number": "26",
        "text": "26So he stood at the entrance to the camp and said, “Whoever is for the Lord, come to me.” And all the Levites rallied to him."
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27Then he said to them, “This is what the Lord, the God of Israel, says: ‘Each man strap a sword to his side. Go back and forth through the camp from one end to the other, each killing his brother and friend and neighbor.’ ”"
    },
    {
        "verse_number": "28",
        "text": "28The Levites did as Moses commanded, and that day about three thousand of the people died."
    },
    {
        "verse_number": "29",
        "text": "29Then Moses said, “You have been set apart to the Lord today, for you were against your own sons and brothers, and he has blessed you this day.”"
    },
    {
        "verse_number": "29",
        "text": ""
    },
    {
        "verse_number": "30",
        "text": "30The next day Moses said to the people, “You have committed a great sin. But now I will go up to the Lord; perhaps I can make atonement for your sin.”"
    },
    {
        "verse_number": "30",
        "text": ""
    },
    {
        "verse_number": "31",
        "text": "31So Moses went back to the Lord and said, “Oh, what a great sin these people have committed! They have made themselves gods of gold."
    },
    {
        "verse_number": "32",
        "text": "32But now, please forgive their sin—but if not, then blot me out of the book you have written.”"
    },
    {
        "verse_number": "32",
        "text": ""
    },
    {
        "verse_number": "33",
        "text": "33The Lord replied to Moses, “Whoever has sinned against me I will blot out of my book."
    },
    {
        "verse_number": "34",
        "text": "34Now go, lead the people to the place I spoke of, and my angel will go before you. However, when the time comes for me to punish, I will punish them for their sin.”"
    },
    {
        "verse_number": "34",
        "text": ""
    },
    {
        "verse_number": "35",
        "text": "35And the Lord struck the people with a plague because of what they did with the calf Aaron had made."
    }
]