[
    {
        "verse_number": "1",
        "text": "1Thus the heavens and the earth were completed in all their vast array."
    },
    {
        "verse_number": "1",
        "text": ""
    },
    {
        "verse_number": "2",
        "text": "2By the seventh day God had finished the work he had been doing; so on the seventh day he rested from all his work."
    },
    {
        "verse_number": "3",
        "text": "3Then God blessed the seventh day and made it holy, because on it he rested from all the work of creating that he had done."
    },
    {
        "verse_number": "3",
        "text": ""
    },
    {
        "verse_number": "4",
        "text": "4This is the account of the heavens and the earth when they were created, when the Lord God made the earth and the heavens."
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5Now no shrub had yet appeared on the earth#2:5 Or land; also in verse 6 and no plant had yet sprung up, for the Lord God had not sent rain on the earth and there was no one to work the ground,"
    },
    {
        "verse_number": "6",
        "text": "6but streams#2:6 Or mist came up from the earth and watered the whole surface of the ground."
    },
    {
        "verse_number": "7",
        "text": "7Then the Lord God formed a man#2:7 The Hebrew for man (adam) sounds like and may be related to the Hebrew for ground (adamah); it is also the name Adam (see verse 20). from the dust of the ground and breathed into his nostrils the breath of life, and the man became a living being."
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8Now the Lord God had planted a garden in the east, in Eden; and there he put the man he had formed."
    },
    {
        "verse_number": "9",
        "text": "9The Lord God made all kinds of trees grow out of the ground—trees that were pleasing to the eye and good for food. In the middle of the garden were the tree of life and the tree of the knowledge of good and evil."
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10A river watering the garden flowed from Eden; from there it was separated into four headwaters."
    },
    {
        "verse_number": "11",
        "text": "11The name of the first is the Pishon; it winds through the entire land of Havilah, where there is gold."
    },
    {
        "verse_number": "12",
        "text": "12(The gold of that land is good; aromatic resin#2:12 Or good; pearls and onyx are also there.)"
    },
    {
        "verse_number": "13",
        "text": "13The name of the second river is the Gihon; it winds through the entire land of Cush.#2:13 Possibly southeast Mesopotamia"
    },
    {
        "verse_number": "14",
        "text": "14The name of the third river is the Tigris; it runs along the east side of Ashur. And the fourth river is the Euphrates."
    },
    {
        "verse_number": "14",
        "text": ""
    },
    {
        "verse_number": "15",
        "text": "15The Lord God took the man and put him in the Garden of Eden to work it and take care of it."
    },
    {
        "verse_number": "16",
        "text": "16And the Lord God commanded the man, “You are free to eat from any tree in the garden;"
    },
    {
        "verse_number": "17",
        "text": "17but you must not eat from the tree of the knowledge of good and evil, for when you eat from it you will certainly die.”"
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18The Lord God said, “It is not good for the man to be alone. I will make a helper suitable for him.”"
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19Now the Lord God had formed out of the ground all the wild animals and all the birds in the sky. He brought them to the man to see what he would name them; and whatever the man called each living creature, that was its name."
    },
    {
        "verse_number": "20",
        "text": "20So the man gave names to all the livestock, the birds in the sky and all the wild animals."
    },
    {
        "verse_number": "20",
        "text": "But for Adam#2:20 Or the man no suitable helper was found."
    },
    {
        "verse_number": "21",
        "text": "21So the Lord God caused the man to fall into a deep sleep; and while he was sleeping, he took one of the man’s ribs#2:21 Or took part of the man’s side and then closed up the place with flesh."
    },
    {
        "verse_number": "22",
        "text": "22Then the Lord God made a woman from the rib#2:22 Or part he had taken out of the man, and he brought her to the man."
    },
    {
        "verse_number": "22",
        "text": ""
    },
    {
        "verse_number": "23",
        "text": "23The man said,"
    },
    {
        "verse_number": "23",
        "text": "“This is now bone of my bones"
    },
    {
        "verse_number": "23",
        "text": "and flesh of my flesh;"
    },
    {
        "verse_number": "23",
        "text": "she shall be called ‘woman,’"
    },
    {
        "verse_number": "23",
        "text": "for she was taken out of man.”"
    },
    {
        "verse_number": "23",
        "text": ""
    },
    {
        "verse_number": "24",
        "text": "24That is why a man leaves his father and mother and is united to his wife, and they become one flesh."
    },
    {
        "verse_number": "24",
        "text": ""
    },
    {
        "verse_number": "25",
        "text": "25Adam and his wife were both naked, and they felt no shame."
    }
]