[
    {
        "verse_number": "1",
        "text": "1Abraham was now very old, and the Lord had blessed him in every way."
    },
    {
        "verse_number": "2",
        "text": "2He said to the senior servant in his household, the one in charge of all that he had, “Put your hand under my thigh."
    },
    {
        "verse_number": "3",
        "text": "3I want you to swear by the Lord, the God of heaven and the God of earth, that you will not get a wife for my son from the daughters of the Canaanites, among whom I am living,"
    },
    {
        "verse_number": "4",
        "text": "4but will go to my country and my own relatives and get a wife for my son Isaac.”"
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5The servant asked him, “What if the woman is unwilling to come back with me to this land? Shall I then take your son back to the country you came from?”"
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6“Make sure that you do not take my son back there,” Abraham said."
    },
    {
        "verse_number": "7",
        "text": "7“The Lord, the God of heaven, who brought me out of my father’s household and my native land and who spoke to me and promised me on oath, saying, ‘To your offspring#24:7 Or seed I will give this land’—he will send his angel before you so that you can get a wife for my son from there."
    },
    {
        "verse_number": "8",
        "text": "8If the woman is unwilling to come back with you, then you will be released from this oath of mine. Only do not take my son back there.”"
    },
    {
        "verse_number": "9",
        "text": "9So the servant put his hand under the thigh of his master Abraham and swore an oath to him concerning this matter."
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10Then the servant left, taking with him ten of his master’s camels loaded with all kinds of good things from his master. He set out for Aram Naharaim#24:10 That is, Northwest Mesopotamia and made his way to the town of Nahor."
    },
    {
        "verse_number": "11",
        "text": "11He had the camels kneel down near the well outside the town; it was toward evening, the time the women go out to draw water."
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12Then he prayed, “Lord, God of my master Abraham, make me successful today, and show kindness to my master Abraham."
    },
    {
        "verse_number": "13",
        "text": "13See, I am standing beside this spring, and the daughters of the townspeople are coming out to draw water."
    },
    {
        "verse_number": "14",
        "text": "14May it be that when I say to a young woman, ‘Please let down your jar that I may have a drink,’ and she says, ‘Drink, and I’ll water your camels too’—let her be the one you have chosen for your servant Isaac. By this I will know that you have shown kindness to my master.”"
    },
    {
        "verse_number": "14",
        "text": ""
    },
    {
        "verse_number": "15",
        "text": "15Before he had finished praying, Rebekah came out with her jar on her shoulder. She was the daughter of Bethuel son of Milkah, who was the wife of Abraham’s brother Nahor."
    },
    {
        "verse_number": "16",
        "text": "16The woman was very beautiful, a virgin; no man had ever slept with her. She went down to the spring, filled her jar and came up again."
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17The servant hurried to meet her and said, “Please give me a little water from your jar.”"
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18“Drink, my lord,” she said, and quickly lowered the jar to her hands and gave him a drink."
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19After she had given him a drink, she said, “I’ll draw water for your camels too, until they have had enough to drink.”"
    },
    {
        "verse_number": "20",
        "text": "20So she quickly emptied her jar into the trough, ran back to the well to draw more water, and drew enough for all his camels."
    },
    {
        "verse_number": "21",
        "text": "21Without saying a word, the man watched her closely to learn whether or not the Lord had made his journey successful."
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22When the camels had finished drinking, the man took out a gold nose ring weighing a beka#24:22 That is, about 1/5 ounce or about 5.7 grams and two gold bracelets weighing ten shekels.#24:22 That is, about 4 ounces or about 115 grams"
    },
    {
        "verse_number": "23",
        "text": "23Then he asked, “Whose daughter are you? Please tell me, is there room in your father’s house for us to spend the night?”"
    },
    {
        "verse_number": "23",
        "text": ""
    },
    {
        "verse_number": "24",
        "text": "24She answered him, “I am the daughter of Bethuel, the son that Milkah bore to Nahor.”"
    },
    {
        "verse_number": "25",
        "text": "25And she added, “We have plenty of straw and fodder, as well as room for you to spend the night.”"
    },
    {
        "verse_number": "25",
        "text": ""
    },
    {
        "verse_number": "26",
        "text": "26Then the man bowed down and worshiped the Lord,"
    },
    {
        "verse_number": "27",
        "text": "27saying, “Praise be to the Lord, the God of my master Abraham, who has not abandoned his kindness and faithfulness to my master. As for me, the Lord has led me on the journey to the house of my master’s relatives.”"
    },
    {
        "verse_number": "27",
        "text": ""
    },
    {
        "verse_number": "28",
        "text": "28The young woman ran and told her mother’s household about these things."
    },
    {
        "verse_number": "29",
        "text": "29Now Rebekah had a brother named Laban, and he hurried out to the man at the spring."
    },
    {
        "verse_number": "30",
        "text": "30As soon as he had seen the nose ring, and the bracelets on his sister’s arms, and had heard Rebekah tell what the man said to her, he went out to the man and found him standing by the camels near the spring."
    },
    {
        "verse_number": "31",
        "text": "31“Come, you who are blessed by the Lord,” he said. “Why are you standing out here? I have prepared the house and a place for the camels.”"
    },
    {
        "verse_number": "31",
        "text": ""
    },
    {
        "verse_number": "32",
        "text": "32So the man went to the house, and the camels were unloaded. Straw and fodder were brought for the camels, and water for him and his men to wash their feet."
    },
    {
        "verse_number": "33",
        "text": "33Then food was set before him, but he said, “I will not eat until I have told you what I have to say.”"
    },
    {
        "verse_number": "33",
        "text": "“Then tell us,” Laban said."
    },
    {
        "verse_number": "33",
        "text": ""
    },
    {
        "verse_number": "34",
        "text": "34So he said, “I am Abraham’s servant."
    },
    {
        "verse_number": "35",
        "text": "35The Lord has blessed my master abundantly, and he has become wealthy. He has given him sheep and cattle, silver and gold, male and female servants, and camels and donkeys."
    },
    {
        "verse_number": "36",
        "text": "36My master’s wife Sarah has borne him a son in her old age, and he has given him everything he owns."
    },
    {
        "verse_number": "37",
        "text": "37And my master made me swear an oath, and said, ‘You must not get a wife for my son from the daughters of the Canaanites, in whose land I live,"
    },
    {
        "verse_number": "38",
        "text": "38but go to my father’s family and to my own clan, and get a wife for my son.’"
    },
    {
        "verse_number": "38",
        "text": ""
    },
    {
        "verse_number": "39",
        "text": "39“Then I asked my master, ‘What if the woman will not come back with me?’"
    },
    {
        "verse_number": "39",
        "text": ""
    },
    {
        "verse_number": "40",
        "text": "40“He replied, ‘The Lord, before whom I have walked faithfully, will send his angel with you and make your journey a success, so that you can get a wife for my son from my own clan and from my father’s family."
    },
    {
        "verse_number": "41",
        "text": "41You will be released from my oath if, when you go to my clan, they refuse to give her to you—then you will be released from my oath.’"
    },
    {
        "verse_number": "41",
        "text": ""
    },
    {
        "verse_number": "42",
        "text": "42“When I came to the spring today, I said, ‘Lord, God of my master Abraham, if you will, please grant success to the journey on which I have come."
    },
    {
        "verse_number": "43",
        "text": "43See, I am standing beside this spring. If a young woman comes out to draw water and I say to her, “Please let me drink a little water from your jar,”"
    },
    {
        "verse_number": "44",
        "text": "44and if she says to me, “Drink, and I’ll draw water for your camels too,” let her be the one the Lord has chosen for my master’s son.’"
    },
    {
        "verse_number": "44",
        "text": ""
    },
    {
        "verse_number": "45",
        "text": "45“Before I finished praying in my heart, Rebekah came out, with her jar on her shoulder. She went down to the spring and drew water, and I said to her, ‘Please give me a drink.’"
    },
    {
        "verse_number": "45",
        "text": ""
    },
    {
        "verse_number": "46",
        "text": "46“She quickly lowered her jar from her shoulder and said, ‘Drink, and I’ll water your camels too.’ So I drank, and she watered the camels also."
    },
    {
        "verse_number": "46",
        "text": ""
    },
    {
        "verse_number": "47",
        "text": "47“I asked her, ‘Whose daughter are you?’"
    },
    {
        "verse_number": "47",
        "text": "“She said, ‘The daughter of Bethuel son of Nahor, whom Milkah bore to him.’"
    },
    {
        "verse_number": "47",
        "text": "“Then I put the ring in her nose and the bracelets on her arms,"
    },
    {
        "verse_number": "48",
        "text": "48and I bowed down and worshiped the Lord. I praised the Lord, the God of my master Abraham, who had led me on the right road to get the granddaughter of my master’s brother for his son."
    },
    {
        "verse_number": "49",
        "text": "49Now if you will show kindness and faithfulness to my master, tell me; and if not, tell me, so I may know which way to turn.”"
    },
    {
        "verse_number": "49",
        "text": ""
    },
    {
        "verse_number": "50",
        "text": "50Laban and Bethuel answered, “This is from the Lord; we can say nothing to you one way or the other."
    },
    {
        "verse_number": "51",
        "text": "51Here is Rebekah; take her and go, and let her become the wife of your master’s son, as the Lord has directed.”"
    },
    {
        "verse_number": "51",
        "text": ""
    },
    {
        "verse_number": "52",
        "text": "52When Abraham’s servant heard what they said, he bowed down to the ground before the Lord."
    },
    {
        "verse_number": "53",
        "text": "53Then the servant brought out gold and silver jewelry and articles of clothing and gave them to Rebekah; he also gave costly gifts to her brother and to her mother."
    },
    {
        "verse_number": "54",
        "text": "54Then he and the men who were with him ate and drank and spent the night there."
    },
    {
        "verse_number": "54",
        "text": "When they got up the next morning, he said, “Send me on my way to my master.”"
    },
    {
        "verse_number": "54",
        "text": ""
    },
    {
        "verse_number": "55",
        "text": "55But her brother and her mother replied, “Let the young woman remain with us ten days or so; then you#24:55 Or she may go.”"
    },
    {
        "verse_number": "55",
        "text": ""
    },
    {
        "verse_number": "56",
        "text": "56But he said to them, “Do not detain me, now that the Lord has granted success to my journey. Send me on my way so I may go to my master.”"
    },
    {
        "verse_number": "56",
        "text": ""
    },
    {
        "verse_number": "57",
        "text": "57Then they said, “Let’s call the young woman and ask her about it.”"
    },
    {
        "verse_number": "58",
        "text": "58So they called Rebekah and asked her, “Will you go with this man?”"
    },
    {
        "verse_number": "58",
        "text": "“I will go,” she said."
    },
    {
        "verse_number": "58",
        "text": ""
    },
    {
        "verse_number": "59",
        "text": "59So they sent their sister Rebekah on her way, along with her nurse and Abraham’s servant and his men."
    },
    {
        "verse_number": "60",
        "text": "60And they blessed Rebekah and said to her,"
    },
    {
        "verse_number": "60",
        "text": "“Our sister, may you increase"
    },
    {
        "verse_number": "60",
        "text": "to thousands upon thousands;"
    },
    {
        "verse_number": "60",
        "text": "may your offspring possess"
    },
    {
        "verse_number": "60",
        "text": "the cities of their enemies.”"
    },
    {
        "verse_number": "60",
        "text": ""
    },
    {
        "verse_number": "61",
        "text": "61Then Rebekah and her attendants got ready and mounted the camels and went back with the man. So the servant took Rebekah and left."
    },
    {
        "verse_number": "61",
        "text": ""
    },
    {
        "verse_number": "62",
        "text": "62Now Isaac had come from Beer Lahai Roi, for he was living in the Negev."
    },
    {
        "verse_number": "63",
        "text": "63He went out to the field one evening to meditate,#24:63 The meaning of the Hebrew for this word is uncertain. and as he looked up, he saw camels approaching."
    },
    {
        "verse_number": "64",
        "text": "64Rebekah also looked up and saw Isaac. She got down from her camel"
    },
    {
        "verse_number": "65",
        "text": "65and asked the servant, “Who is that man in the field coming to meet us?”"
    },
    {
        "verse_number": "65",
        "text": "“He is my master,” the servant answered. So she took her veil and covered herself."
    },
    {
        "verse_number": "65",
        "text": ""
    },
    {
        "verse_number": "66",
        "text": "66Then the servant told Isaac all he had done."
    },
    {
        "verse_number": "67",
        "text": "67Isaac brought her into the tent of his mother Sarah, and he married Rebekah. So she became his wife, and he loved her; and Isaac was comforted after his mother’s death."
    }
]