[
    {
        "verse_number": "1",
        "text": "1Jacob also went on his way, and the angels of God met him."
    },
    {
        "verse_number": "2",
        "text": "2When Jacob saw them, he said, “This is the camp of God!” So he named that place Mahanaim.#32:2 Mahanaim means two camps."
    },
    {
        "verse_number": "2",
        "text": ""
    },
    {
        "verse_number": "3",
        "text": "3Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
    },
    {
        "verse_number": "4",
        "text": "4He instructed them: “This is what you are to say to my lord Esau: ‘Your servant Jacob says, I have been staying with Laban and have remained there till now."
    },
    {
        "verse_number": "5",
        "text": "5I have cattle and donkeys, sheep and goats, male and female servants. Now I am sending this message to my lord, that I may find favor in your eyes.’ ”"
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6When the messengers returned to Jacob, they said, “We went to your brother Esau, and now he is coming to meet you, and four hundred men are with him.”"
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7In great fear and distress Jacob divided the people who were with him into two groups,#32:7 Or camps and the flocks and herds and camels as well."
    },
    {
        "verse_number": "8",
        "text": "8He thought, “If Esau comes and attacks one group,#32:8 Or camp the group#32:8 Or camp that is left may escape.”"
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9Then Jacob prayed, “O God of my father Abraham, God of my father Isaac, Lord, you who said to me, ‘Go back to your country and your relatives, and I will make you prosper,’"
    },
    {
        "verse_number": "10",
        "text": "10I am unworthy of all the kindness and faithfulness you have shown your servant. I had only my staff when I crossed this Jordan, but now I have become two camps."
    },
    {
        "verse_number": "11",
        "text": "11Save me, I pray, from the hand of my brother Esau, for I am afraid he will come and attack me, and also the mothers with their children."
    },
    {
        "verse_number": "12",
        "text": "12But you have said, ‘I will surely make you prosper and will make your descendants like the sand of the sea, which cannot be counted.’ ”"
    },
    {
        "verse_number": "12",
        "text": ""
    },
    {
        "verse_number": "13",
        "text": "13He spent the night there, and from what he had with him he selected a gift for his brother Esau:"
    },
    {
        "verse_number": "14",
        "text": "14two hundred female goats and twenty male goats, two hundred ewes and twenty rams,"
    },
    {
        "verse_number": "15",
        "text": "15thirty female camels with their young, forty cows and ten bulls, and twenty female donkeys and ten male donkeys."
    },
    {
        "verse_number": "16",
        "text": "16He put them in the care of his servants, each herd by itself, and said to his servants, “Go ahead of me, and keep some space between the herds.”"
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17He instructed the one in the lead: “When my brother Esau meets you and asks, ‘Who do you belong to, and where are you going, and who owns all these animals in front of you?’"
    },
    {
        "verse_number": "18",
        "text": "18then you are to say, ‘They belong to your servant Jacob. They are a gift sent to my lord Esau, and he is coming behind us.’ ”"
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19He also instructed the second, the third and all the others who followed the herds: “You are to say the same thing to Esau when you meet him."
    },
    {
        "verse_number": "20",
        "text": "20And be sure to say, ‘Your servant Jacob is coming behind us.’ ” For he thought, “I will pacify him with these gifts I am sending on ahead; later, when I see him, perhaps he will receive me.”"
    },
    {
        "verse_number": "21",
        "text": "21So Jacob’s gifts went on ahead of him, but he himself spent the night in the camp."
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22That night Jacob got up and took his two wives, his two female servants and his eleven sons and crossed the ford of the Jabbok."
    },
    {
        "verse_number": "23",
        "text": "23After he had sent them across the stream, he sent over all his possessions."
    },
    {
        "verse_number": "24",
        "text": "24So Jacob was left alone, and a man wrestled with him till daybreak."
    },
    {
        "verse_number": "25",
        "text": "25When the man saw that he could not overpower him, he touched the socket of Jacob’s hip so that his hip was wrenched as he wrestled with the man."
    },
    {
        "verse_number": "26",
        "text": "26Then the man said, “Let me go, for it is daybreak.”"
    },
    {
        "verse_number": "26",
        "text": "But Jacob replied, “I will not let you go unless you bless me.”"
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27The man asked him, “What is your name?”"
    },
    {
        "verse_number": "27",
        "text": "“Jacob,” he answered."
    },
    {
        "verse_number": "27",
        "text": ""
    },
    {
        "verse_number": "28",
        "text": "28Then the man said, “Your name will no longer be Jacob, but Israel,#32:28 Israel probably means he struggles with God. because you have struggled with God and with humans and have overcome.”"
    },
    {
        "verse_number": "28",
        "text": ""
    },
    {
        "verse_number": "29",
        "text": "29Jacob said, “Please tell me your name.”"
    },
    {
        "verse_number": "29",
        "text": "But he replied, “Why do you ask my name?” Then he blessed him there."
    },
    {
        "verse_number": "29",
        "text": ""
    },
    {
        "verse_number": "30",
        "text": "30So Jacob called the place Peniel,#32:30 Peniel means face of God. saying, “It is because I saw God face to face, and yet my life was spared.”"
    },
    {
        "verse_number": "30",
        "text": ""
    },
    {
        "verse_number": "31",
        "text": "31The sun rose above him as he passed Peniel,#32:31 Hebrew Penuel, a variant of Peniel and he was limping because of his hip."
    },
    {
        "verse_number": "32",
        "text": "32Therefore to this day the Israelites do not eat the tendon attached to the socket of the hip, because the socket of Jacob’s hip was touched near the tendon."
    }
]