[
    {
        "verse_number": "1",
        "text": "1Now Sarai, Abram’s wife, had borne him no children. But she had an Egyptian slave named Hagar;"
    },
    {
        "verse_number": "2",
        "text": "2so she said to Abram, “The Lord has kept me from having children. Go, sleep with my slave; perhaps I can build a family through her.”"
    },
    {
        "verse_number": "2",
        "text": "Abram agreed to what Sarai said."
    },
    {
        "verse_number": "3",
        "text": "3So after Abram had been living in Canaan ten years, Sarai his wife took her Egyptian slave Hagar and gave her to her husband to be his wife."
    },
    {
        "verse_number": "4",
        "text": "4He slept with Hagar, and she conceived."
    },
    {
        "verse_number": "4",
        "text": "When she knew she was pregnant, she began to despise her mistress."
    },
    {
        "verse_number": "5",
        "text": "5Then Sarai said to Abram, “You are responsible for the wrong I am suffering. I put my slave in your arms, and now that she knows she is pregnant, she despises me. May the Lord judge between you and me.”"
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6“Your slave is in your hands,” Abram said. “Do with her whatever you think best.” Then Sarai mistreated Hagar; so she fled from her."
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7The angel of the Lord found Hagar near a spring in the desert; it was the spring that is beside the road to Shur."
    },
    {
        "verse_number": "8",
        "text": "8And he said, “Hagar, slave of Sarai, where have you come from, and where are you going?”"
    },
    {
        "verse_number": "8",
        "text": "“I’m running away from my mistress Sarai,” she answered."
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9Then the angel of the Lord told her, “Go back to your mistress and submit to her.”"
    },
    {
        "verse_number": "10",
        "text": "10The angel added, “I will increase your descendants so much that they will be too numerous to count.”"
    },
    {
        "verse_number": "10",
        "text": ""
    },
    {
        "verse_number": "11",
        "text": "11The angel of the Lord also said to her:"
    },
    {
        "verse_number": "11",
        "text": "“You are now pregnant"
    },
    {
        "verse_number": "11",
        "text": "and you will give birth to a son."
    },
    {
        "verse_number": "11",
        "text": "You shall name him Ishmael,#16:11 Ishmael means God hears."
    },
    {
        "verse_number": "11",
        "text": "for the Lord has heard of your misery."
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12He will be a wild donkey of a man;"
    },
    {
        "verse_number": "12",
        "text": "his hand will be against everyone"
    },
    {
        "verse_number": "12",
        "text": "and everyone’s hand against him,"
    },
    {
        "verse_number": "12",
        "text": "and he will live in hostility"
    },
    {
        "verse_number": "12",
        "text": "toward#16:12 Or live to the east / of all his brothers.”"
    },
    {
        "verse_number": "12",
        "text": ""
    },
    {
        "verse_number": "13",
        "text": "13She gave this name to the Lord who spoke to her: “You are the God who sees me,” for she said, “I have now seen#16:13 Or seen the back of the One who sees me.”"
    },
    {
        "verse_number": "14",
        "text": "14That is why the well was called Beer Lahai Roi#16:14 Beer Lahai Roi means well of the Living One who sees me.; it is still there, between Kadesh and Bered."
    },
    {
        "verse_number": "14",
        "text": ""
    },
    {
        "verse_number": "15",
        "text": "15So Hagar bore Abram a son, and Abram gave the name Ishmael to the son she had borne."
    },
    {
        "verse_number": "16",
        "text": "16Abram was eighty-six years old when Hagar bore him Ishmael."
    }
]