[
    {
        "verse_number": "1",
        "text": "1Abraham had taken another wife, whose name was Keturah."
    },
    {
        "verse_number": "2",
        "text": "2She bore him Zimran, Jokshan, Medan, Midian, Ishbak and Shuah."
    },
    {
        "verse_number": "3",
        "text": "3Jokshan was the father of Sheba and Dedan; the descendants of Dedan were the Ashurites, the Letushites and the Leummites."
    },
    {
        "verse_number": "4",
        "text": "4The sons of Midian were Ephah, Epher, Hanok, Abida and Eldaah. All these were descendants of Keturah."
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5Abraham left everything he owned to Isaac."
    },
    {
        "verse_number": "6",
        "text": "6But while he was still living, he gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east."
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7Abraham lived a hundred and seventy-five years."
    },
    {
        "verse_number": "8",
        "text": "8Then Abraham breathed his last and died at a good old age, an old man and full of years; and he was gathered to his people."
    },
    {
        "verse_number": "9",
        "text": "9His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite,"
    },
    {
        "verse_number": "10",
        "text": "10the field Abraham had bought from the Hittites.#25:10 Or the descendants of Heth There Abraham was buried with his wife Sarah."
    },
    {
        "verse_number": "11",
        "text": "11After Abraham’s death, God blessed his son Isaac, who then lived near Beer Lahai Roi."
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12This is the account of the family line of Abraham’s son Ishmael, whom Sarah’s slave, Hagar the Egyptian, bore to Abraham."
    },
    {
        "verse_number": "12",
        "text": ""
    },
    {
        "verse_number": "13",
        "text": "13These are the names of the sons of Ishmael, listed in the order of their birth: Nebaioth the firstborn of Ishmael, Kedar, Adbeel, Mibsam,"
    },
    {
        "verse_number": "14",
        "text": "14Mishma, Dumah, Massa,"
    },
    {
        "verse_number": "15",
        "text": "15Hadad, Tema, Jetur, Naphish and Kedemah."
    },
    {
        "verse_number": "16",
        "text": "16These were the sons of Ishmael, and these are the names of the twelve tribal rulers according to their settlements and camps."
    },
    {
        "verse_number": "17",
        "text": "17Ishmael lived a hundred and thirty-seven years. He breathed his last and died, and he was gathered to his people."
    },
    {
        "verse_number": "18",
        "text": "18His descendants settled in the area from Havilah to Shur, near the eastern border of Egypt, as you go toward Ashur. And they lived in hostility toward#25:18 Or lived to the east of all the tribes related to them."
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19This is the account of the family line of Abraham’s son Isaac."
    },
    {
        "verse_number": "19",
        "text": "Abraham became the father of Isaac,"
    },
    {
        "verse_number": "20",
        "text": "20and Isaac was forty years old when he married Rebekah daughter of Bethuel the Aramean from Paddan Aram#25:20 That is, Northwest Mesopotamia and sister of Laban the Aramean."
    },
    {
        "verse_number": "20",
        "text": ""
    },
    {
        "verse_number": "21",
        "text": "21Isaac prayed to the Lord on behalf of his wife, because she was childless. The Lord answered his prayer, and his wife Rebekah became pregnant."
    },
    {
        "verse_number": "22",
        "text": "22The babies jostled each other within her, and she said, “Why is this happening to me?” So she went to inquire of the Lord."
    },
    {
        "verse_number": "22",
        "text": ""
    },
    {
        "verse_number": "23",
        "text": "23The Lord said to her,"
    },
    {
        "verse_number": "23",
        "text": "“Two nations are in your womb,"
    },
    {
        "verse_number": "23",
        "text": "and two peoples from within you will be separated;"
    },
    {
        "verse_number": "23",
        "text": "one people will be stronger than the other,"
    },
    {
        "verse_number": "23",
        "text": "and the older will serve the younger.”"
    },
    {
        "verse_number": "23",
        "text": ""
    },
    {
        "verse_number": "24",
        "text": "24When the time came for her to give birth, there were twin boys in her womb."
    },
    {
        "verse_number": "25",
        "text": "25The first to come out was red, and his whole body was like a hairy garment; so they named him Esau.#25:25 Esau may mean hairy."
    },
    {
        "verse_number": "26",
        "text": "26After this, his brother came out, with his hand grasping Esau’s heel; so he was named Jacob.#25:26 Jacob means he grasps the heel, a Hebrew idiom for he deceives. Isaac was sixty years old when Rebekah gave birth to them."
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27The boys grew up, and Esau became a skillful hunter, a man of the open country, while Jacob was content to stay at home among the tents."
    },
    {
        "verse_number": "28",
        "text": "28Isaac, who had a taste for wild game, loved Esau, but Rebekah loved Jacob."
    },
    {
        "verse_number": "28",
        "text": ""
    },
    {
        "verse_number": "29",
        "text": "29Once when Jacob was cooking some stew, Esau came in from the open country, famished."
    },
    {
        "verse_number": "30",
        "text": "30He said to Jacob, “Quick, let me have some of that red stew! I’m famished!” (That is why he was also called Edom.#25:30 Edom means red.)"
    },
    {
        "verse_number": "30",
        "text": ""
    },
    {
        "verse_number": "31",
        "text": "31Jacob replied, “First sell me your birthright.”"
    },
    {
        "verse_number": "31",
        "text": ""
    },
    {
        "verse_number": "32",
        "text": "32“Look, I am about to die,” Esau said. “What good is the birthright to me?”"
    },
    {
        "verse_number": "32",
        "text": ""
    },
    {
        "verse_number": "33",
        "text": "33But Jacob said, “Swear to me first.” So he swore an oath to him, selling his birthright to Jacob."
    },
    {
        "verse_number": "33",
        "text": ""
    },
    {
        "verse_number": "34",
        "text": "34Then Jacob gave Esau some bread and some lentil stew. He ate and drank, and then got up and left."
    },
    {
        "verse_number": "34",
        "text": "So Esau despised his birthright."
    }
]