[
    {
        "verse_number": "1",
        "text": "1Now the whole world had one language and a common speech."
    },
    {
        "verse_number": "2",
        "text": "2As people moved eastward,#11:2 Or from the east; or in the east they found a plain in Shinar#11:2 That is, Babylonia and settled there."
    },
    {
        "verse_number": "2",
        "text": ""
    },
    {
        "verse_number": "3",
        "text": "3They said to each other, “Come, let’s make bricks and bake them thoroughly.” They used brick instead of stone, and tar for mortar."
    },
    {
        "verse_number": "4",
        "text": "4Then they said, “Come, let us build ourselves a city, with a tower that reaches to the heavens, so that we may make a name for ourselves; otherwise we will be scattered over the face of the whole earth.”"
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5But the Lord came down to see the city and the tower the people were building."
    },
    {
        "verse_number": "6",
        "text": "6The Lord said, “If as one people speaking the same language they have begun to do this, then nothing they plan to do will be impossible for them."
    },
    {
        "verse_number": "7",
        "text": "7Come, let us go down and confuse their language so they will not understand each other.”"
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8So the Lord scattered them from there over all the earth, and they stopped building the city."
    },
    {
        "verse_number": "9",
        "text": "9That is why it was called Babel#11:9 That is, Babylon; Babel sounds like the Hebrew for confused.—because there the Lord confused the language of the whole world. From there the Lord scattered them over the face of the whole earth."
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10This is the account of Shem’s family line."
    },
    {
        "verse_number": "10",
        "text": "Two years after the flood, when Shem was 100 years old, he became the father#11:10 Father may mean ancestor; also in verses 11-25. of Arphaxad."
    },
    {
        "verse_number": "11",
        "text": "11And after he became the father of Arphaxad, Shem lived 500 years and had other sons and daughters."
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12When Arphaxad had lived 35 years, he became the father of Shelah."
    },
    {
        "verse_number": "13",
        "text": "13And after he became the father of Shelah, Arphaxad lived 403 years and had other sons and daughters.#11:13 Hebrew; Septuagint (see also Luke 3:35,36 and note at Gen. 10:24) 35 years, he became the father of Cainan. 13 And after he became the father of Cainan, Arphaxad lived 430 years and had other sons and daughters, and then he died. When Cainan had lived 130 years, he became the father of Shelah. And after he became the father of Shelah, Cainan lived 330 years and had other sons and daughters"
    },
    {
        "verse_number": "13",
        "text": ""
    },
    {
        "verse_number": "14",
        "text": "14When Shelah had lived 30 years, he became the father of Eber."
    },
    {
        "verse_number": "15",
        "text": "15And after he became the father of Eber, Shelah lived 403 years and had other sons and daughters."
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16When Eber had lived 34 years, he became the father of Peleg."
    },
    {
        "verse_number": "17",
        "text": "17And after he became the father of Peleg, Eber lived 430 years and had other sons and daughters."
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18When Peleg had lived 30 years, he became the father of Reu."
    },
    {
        "verse_number": "19",
        "text": "19And after he became the father of Reu, Peleg lived 209 years and had other sons and daughters."
    },
    {
        "verse_number": "19",
        "text": ""
    },
    {
        "verse_number": "20",
        "text": "20When Reu had lived 32 years, he became the father of Serug."
    },
    {
        "verse_number": "21",
        "text": "21And after he became the father of Serug, Reu lived 207 years and had other sons and daughters."
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22When Serug had lived 30 years, he became the father of Nahor."
    },
    {
        "verse_number": "23",
        "text": "23And after he became the father of Nahor, Serug lived 200 years and had other sons and daughters."
    },
    {
        "verse_number": "23",
        "text": ""
    },
    {
        "verse_number": "24",
        "text": "24When Nahor had lived 29 years, he became the father of Terah."
    },
    {
        "verse_number": "25",
        "text": "25And after he became the father of Terah, Nahor lived 119 years and had other sons and daughters."
    },
    {
        "verse_number": "25",
        "text": ""
    },
    {
        "verse_number": "26",
        "text": "26After Terah had lived 70 years, he became the father of Abram, Nahor and Haran."
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27This is the account of Terah’s family line."
    },
    {
        "verse_number": "27",
        "text": "Terah became the father of Abram, Nahor and Haran. And Haran became the father of Lot."
    },
    {
        "verse_number": "28",
        "text": "28While his father Terah was still alive, Haran died in Ur of the Chaldeans, in the land of his birth."
    },
    {
        "verse_number": "29",
        "text": "29Abram and Nahor both married. The name of Abram’s wife was Sarai, and the name of Nahor’s wife was Milkah; she was the daughter of Haran, the father of both Milkah and Iskah."
    },
    {
        "verse_number": "30",
        "text": "30Now Sarai was childless because she was not able to conceive."
    },
    {
        "verse_number": "30",
        "text": ""
    },
    {
        "verse_number": "31",
        "text": "31Terah took his son Abram, his grandson Lot son of Haran, and his daughter-in-law Sarai, the wife of his son Abram, and together they set out from Ur of the Chaldeans to go to Canaan. But when they came to Harran, they settled there."
    },
    {
        "verse_number": "31",
        "text": ""
    },
    {
        "verse_number": "32",
        "text": "32Terah lived 205 years, and he died in Harran."
    }
]