[
    {
        "verse_number": "1",
        "text": "1The Lord appeared to Abraham near the great trees of Mamre while he was sitting at the entrance to his tent in the heat of the day."
    },
    {
        "verse_number": "2",
        "text": "2Abraham looked up and saw three men standing nearby. When he saw them, he hurried from the entrance of his tent to meet them and bowed low to the ground."
    },
    {
        "verse_number": "2",
        "text": ""
    },
    {
        "verse_number": "3",
        "text": "3He said, “If I have found favor in your eyes, my lord,#18:3 Or eyes, Lord do not pass your servant by."
    },
    {
        "verse_number": "4",
        "text": "4Let a little water be brought, and then you may all wash your feet and rest under this tree."
    },
    {
        "verse_number": "5",
        "text": "5Let me get you something to eat, so you can be refreshed and then go on your way—now that you have come to your servant.”"
    },
    {
        "verse_number": "5",
        "text": "“Very well,” they answered, “do as you say.”"
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6So Abraham hurried into the tent to Sarah. “Quick,” he said, “get three seahs#18:6 That is, probably about 36 pounds or about 16 kilograms of the finest flour and knead it and bake some bread.”"
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7Then he ran to the herd and selected a choice, tender calf and gave it to a servant, who hurried to prepare it."
    },
    {
        "verse_number": "8",
        "text": "8He then brought some curds and milk and the calf that had been prepared, and set these before them. While they ate, he stood near them under a tree."
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9“Where is your wife Sarah?” they asked him."
    },
    {
        "verse_number": "9",
        "text": "“There, in the tent,” he said."
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10Then one of them said, “I will surely return to you about this time next year, and Sarah your wife will have a son.”"
    },
    {
        "verse_number": "10",
        "text": "Now Sarah was listening at the entrance to the tent, which was behind him."
    },
    {
        "verse_number": "11",
        "text": "11Abraham and Sarah were already very old, and Sarah was past the age of childbearing."
    },
    {
        "verse_number": "12",
        "text": "12So Sarah laughed to herself as she thought, “After I am worn out and my lord is old, will I now have this pleasure?”"
    },
    {
        "verse_number": "12",
        "text": ""
    },
    {
        "verse_number": "13",
        "text": "13Then the Lord said to Abraham, “Why did Sarah laugh and say, ‘Will I really have a child, now that I am old?’"
    },
    {
        "verse_number": "14",
        "text": "14Is anything too hard for the Lord? I will return to you at the appointed time next year, and Sarah will have a son.”"
    },
    {
        "verse_number": "14",
        "text": ""
    },
    {
        "verse_number": "15",
        "text": "15Sarah was afraid, so she lied and said, “I did not laugh.”"
    },
    {
        "verse_number": "15",
        "text": "But he said, “Yes, you did laugh.”"
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16When the men got up to leave, they looked down toward Sodom, and Abraham walked along with them to see them on their way."
    },
    {
        "verse_number": "17",
        "text": "17Then the Lord said, “Shall I hide from Abraham what I am about to do?"
    },
    {
        "verse_number": "18",
        "text": "18Abraham will surely become a great and powerful nation, and all nations on earth will be blessed through him.#18:18 Or will use his name in blessings (see 48:20)"
    },
    {
        "verse_number": "19",
        "text": "19For I have chosen him, so that he will direct his children and his household after him to keep the way of the Lord by doing what is right and just, so that the Lord will bring about for Abraham what he has promised him.”"
    },
    {
        "verse_number": "19",
        "text": ""
    },
    {
        "verse_number": "20",
        "text": "20Then the Lord said, “The outcry against Sodom and Gomorrah is so great and their sin so grievous"
    },
    {
        "verse_number": "21",
        "text": "21that I will go down and see if what they have done is as bad as the outcry that has reached me. If not, I will know.”"
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22The men turned away and went toward Sodom, but Abraham remained standing before the Lord.#18:22 Masoretic Text; an ancient Hebrew scribal tradition but the Lord remained standing before Abraham"
    },
    {
        "verse_number": "23",
        "text": "23Then Abraham approached him and said: “Will you sweep away the righteous with the wicked?"
    },
    {
        "verse_number": "24",
        "text": "24What if there are fifty righteous people in the city? Will you really sweep it away and not spare#18:24 Or forgive; also in verse 26 the place for the sake of the fifty righteous people in it?"
    },
    {
        "verse_number": "25",
        "text": "25Far be it from you to do such a thing—to kill the righteous with the wicked, treating the righteous and the wicked alike. Far be it from you! Will not the Judge of all the earth do right?”"
    },
    {
        "verse_number": "25",
        "text": ""
    },
    {
        "verse_number": "26",
        "text": "26The Lord said, “If I find fifty righteous people in the city of Sodom, I will spare the whole place for their sake.”"
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27Then Abraham spoke up again: “Now that I have been so bold as to speak to the Lord, though I am nothing but dust and ashes,"
    },
    {
        "verse_number": "28",
        "text": "28what if the number of the righteous is five less than fifty? Will you destroy the whole city for lack of five people?”"
    },
    {
        "verse_number": "28",
        "text": "“If I find forty-five there,” he said, “I will not destroy it.”"
    },
    {
        "verse_number": "28",
        "text": ""
    },
    {
        "verse_number": "29",
        "text": "29Once again he spoke to him, “What if only forty are found there?”"
    },
    {
        "verse_number": "29",
        "text": "He said, “For the sake of forty, I will not do it.”"
    },
    {
        "verse_number": "29",
        "text": ""
    },
    {
        "verse_number": "30",
        "text": "30Then he said, “May the Lord not be angry, but let me speak. What if only thirty can be found there?”"
    },
    {
        "verse_number": "30",
        "text": "He answered, “I will not do it if I find thirty there.”"
    },
    {
        "verse_number": "30",
        "text": ""
    },
    {
        "verse_number": "31",
        "text": "31Abraham said, “Now that I have been so bold as to speak to the Lord, what if only twenty can be found there?”"
    },
    {
        "verse_number": "31",
        "text": "He said, “For the sake of twenty, I will not destroy it.”"
    },
    {
        "verse_number": "31",
        "text": ""
    },
    {
        "verse_number": "32",
        "text": "32Then he said, “May the Lord not be angry, but let me speak just once more. What if only ten can be found there?”"
    },
    {
        "verse_number": "32",
        "text": "He answered, “For the sake of ten, I will not destroy it.”"
    },
    {
        "verse_number": "32",
        "text": ""
    },
    {
        "verse_number": "33",
        "text": "33When the Lord had finished speaking with Abraham, he left, and Abraham returned home."
    }
]