[
    {
        "verse_number": "1",
        "text": "1When Rachel saw that she was not bearing Jacob any children, she became jealous of her sister. So she said to Jacob, “Give me children, or I’ll die!”"
    },
    {
        "verse_number": "1",
        "text": ""
    },
    {
        "verse_number": "2",
        "text": "2Jacob became angry with her and said, “Am I in the place of God, who has kept you from having children?”"
    },
    {
        "verse_number": "2",
        "text": ""
    },
    {
        "verse_number": "3",
        "text": "3Then she said, “Here is Bilhah, my servant. Sleep with her so that she can bear children for me and I too can build a family through her.”"
    },
    {
        "verse_number": "3",
        "text": ""
    },
    {
        "verse_number": "4",
        "text": "4So she gave him her servant Bilhah as a wife. Jacob slept with her,"
    },
    {
        "verse_number": "5",
        "text": "5and she became pregnant and bore him a son."
    },
    {
        "verse_number": "6",
        "text": "6Then Rachel said, “God has vindicated me; he has listened to my plea and given me a son.” Because of this she named him Dan.#30:6 Dan here means he has vindicated."
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7Rachel’s servant Bilhah conceived again and bore Jacob a second son."
    },
    {
        "verse_number": "8",
        "text": "8Then Rachel said, “I have had a great struggle with my sister, and I have won.” So she named him Naphtali.#30:8 Naphtali means my struggle."
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9When Leah saw that she had stopped having children, she took her servant Zilpah and gave her to Jacob as a wife."
    },
    {
        "verse_number": "10",
        "text": "10Leah’s servant Zilpah bore Jacob a son."
    },
    {
        "verse_number": "11",
        "text": "11Then Leah said, “What good fortune!”#30:11 Or “A troop is coming!” So she named him Gad.#30:11 Gad can mean good fortune or troop."
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12Leah’s servant Zilpah bore Jacob a second son."
    },
    {
        "verse_number": "13",
        "text": "13Then Leah said, “How happy I am! The women will call me happy.” So she named him Asher.#30:13 Asher means happy."
    },
    {
        "verse_number": "13",
        "text": ""
    },
    {
        "verse_number": "14",
        "text": "14During wheat harvest, Reuben went out into the fields and found some mandrake plants, which he brought to his mother Leah. Rachel said to Leah, “Please give me some of your son’s mandrakes.”"
    },
    {
        "verse_number": "14",
        "text": ""
    },
    {
        "verse_number": "15",
        "text": "15But she said to her, “Wasn’t it enough that you took away my husband? Will you take my son’s mandrakes too?”"
    },
    {
        "verse_number": "15",
        "text": "“Very well,” Rachel said, “he can sleep with you tonight in return for your son’s mandrakes.”"
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16So when Jacob came in from the fields that evening, Leah went out to meet him. “You must sleep with me,” she said. “I have hired you with my son’s mandrakes.” So he slept with her that night."
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17God listened to Leah, and she became pregnant and bore Jacob a fifth son."
    },
    {
        "verse_number": "18",
        "text": "18Then Leah said, “God has rewarded me for giving my servant to my husband.” So she named him Issachar.#30:18 Issachar sounds like the Hebrew for reward."
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19Leah conceived again and bore Jacob a sixth son."
    },
    {
        "verse_number": "20",
        "text": "20Then Leah said, “God has presented me with a precious gift. This time my husband will treat me with honor, because I have borne him six sons.” So she named him Zebulun.#30:20 Zebulun probably means honor."
    },
    {
        "verse_number": "20",
        "text": ""
    },
    {
        "verse_number": "21",
        "text": "21Some time later she gave birth to a daughter and named her Dinah."
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22Then God remembered Rachel; he listened to her and enabled her to conceive."
    },
    {
        "verse_number": "23",
        "text": "23She became pregnant and gave birth to a son and said, “God has taken away my disgrace.”"
    },
    {
        "verse_number": "24",
        "text": "24She named him Joseph,#30:24 Joseph means may he add. and said, “May the Lord add to me another son.”"
    },
    {
        "verse_number": "24",
        "text": ""
    },
    {
        "verse_number": "25",
        "text": "25After Rachel gave birth to Joseph, Jacob said to Laban, “Send me on my way so I can go back to my own homeland."
    },
    {
        "verse_number": "26",
        "text": "26Give me my wives and children, for whom I have served you, and I will be on my way. You know how much work I’ve done for you.”"
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27But Laban said to him, “If I have found favor in your eyes, please stay. I have learned by divination that the Lord has blessed me because of you.”"
    },
    {
        "verse_number": "28",
        "text": "28He added, “Name your wages, and I will pay them.”"
    },
    {
        "verse_number": "28",
        "text": ""
    },
    {
        "verse_number": "29",
        "text": "29Jacob said to him, “You know how I have worked for you and how your livestock has fared under my care."
    },
    {
        "verse_number": "30",
        "text": "30The little you had before I came has increased greatly, and the Lord has blessed you wherever I have been. But now, when may I do something for my own household?”"
    },
    {
        "verse_number": "30",
        "text": ""
    },
    {
        "verse_number": "31",
        "text": "31“What shall I give you?” he asked."
    },
    {
        "verse_number": "31",
        "text": "“Don’t give me anything,” Jacob replied. “But if you will do this one thing for me, I will go on tending your flocks and watching over them:"
    },
    {
        "verse_number": "32",
        "text": "32Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb and every spotted or speckled goat. They will be my wages."
    },
    {
        "verse_number": "33",
        "text": "33And my honesty will testify for me in the future, whenever you check on the wages you have paid me. Any goat in my possession that is not speckled or spotted, or any lamb that is not dark-colored, will be considered stolen.”"
    },
    {
        "verse_number": "33",
        "text": ""
    },
    {
        "verse_number": "34",
        "text": "34“Agreed,” said Laban. “Let it be as you have said.”"
    },
    {
        "verse_number": "35",
        "text": "35That same day he removed all the male goats that were streaked or spotted, and all the speckled or spotted female goats (all that had white on them) and all the dark-colored lambs, and he placed them in the care of his sons."
    },
    {
        "verse_number": "36",
        "text": "36Then he put a three-day journey between himself and Jacob, while Jacob continued to tend the rest of Laban’s flocks."
    },
    {
        "verse_number": "36",
        "text": ""
    },
    {
        "verse_number": "37",
        "text": "37Jacob, however, took fresh-cut branches from poplar, almond and plane trees and made white stripes on them by peeling the bark and exposing the white inner wood of the branches."
    },
    {
        "verse_number": "38",
        "text": "38Then he placed the peeled branches in all the watering troughs, so that they would be directly in front of the flocks when they came to drink. When the flocks were in heat and came to drink,"
    },
    {
        "verse_number": "39",
        "text": "39they mated in front of the branches. And they bore young that were streaked or speckled or spotted."
    },
    {
        "verse_number": "40",
        "text": "40Jacob set apart the young of the flock by themselves, but made the rest face the streaked and dark-colored animals that belonged to Laban. Thus he made separate flocks for himself and did not put them with Laban’s animals."
    },
    {
        "verse_number": "41",
        "text": "41Whenever the stronger females were in heat, Jacob would place the branches in the troughs in front of the animals so they would mate near the branches,"
    },
    {
        "verse_number": "42",
        "text": "42but if the animals were weak, he would not place them there. So the weak animals went to Laban and the strong ones to Jacob."
    },
    {
        "verse_number": "43",
        "text": "43In this way the man grew exceedingly prosperous and came to own large flocks, and female and male servants, and camels and donkeys."
    }
]