[
    {
        "verse_number": "1",
        "text": "1This is the written account of Adam’s family line."
    },
    {
        "verse_number": "1",
        "text": "When God created mankind, he made them in the likeness of God."
    },
    {
        "verse_number": "2",
        "text": "2He created them male and female and blessed them. And he named them “Mankind”#5:2 Hebrew adam when they were created."
    },
    {
        "verse_number": "2",
        "text": ""
    },
    {
        "verse_number": "3",
        "text": "3When Adam had lived 130 years, he had a son in his own likeness, in his own image; and he named him Seth."
    },
    {
        "verse_number": "4",
        "text": "4After Seth was born, Adam lived 800 years and had other sons and daughters."
    },
    {
        "verse_number": "5",
        "text": "5Altogether, Adam lived a total of 930 years, and then he died."
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6When Seth had lived 105 years, he became the father#5:6 Father may mean ancestor; also in verses 7-26. of Enosh."
    },
    {
        "verse_number": "7",
        "text": "7After he became the father of Enosh, Seth lived 807 years and had other sons and daughters."
    },
    {
        "verse_number": "8",
        "text": "8Altogether, Seth lived a total of 912 years, and then he died."
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9When Enosh had lived 90 years, he became the father of Kenan."
    },
    {
        "verse_number": "10",
        "text": "10After he became the father of Kenan, Enosh lived 815 years and had other sons and daughters."
    },
    {
        "verse_number": "11",
        "text": "11Altogether, Enosh lived a total of 905 years, and then he died."
    },
    {
        "verse_number": "11",
        "text": ""
    },
    {
        "verse_number": "12",
        "text": "12When Kenan had lived 70 years, he became the father of Mahalalel."
    },
    {
        "verse_number": "13",
        "text": "13After he became the father of Mahalalel, Kenan lived 840 years and had other sons and daughters."
    },
    {
        "verse_number": "14",
        "text": "14Altogether, Kenan lived a total of 910 years, and then he died."
    },
    {
        "verse_number": "14",
        "text": ""
    },
    {
        "verse_number": "15",
        "text": "15When Mahalalel had lived 65 years, he became the father of Jared."
    },
    {
        "verse_number": "16",
        "text": "16After he became the father of Jared, Mahalalel lived 830 years and had other sons and daughters."
    },
    {
        "verse_number": "17",
        "text": "17Altogether, Mahalalel lived a total of 895 years, and then he died."
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18When Jared had lived 162 years, he became the father of Enoch."
    },
    {
        "verse_number": "19",
        "text": "19After he became the father of Enoch, Jared lived 800 years and had other sons and daughters."
    },
    {
        "verse_number": "20",
        "text": "20Altogether, Jared lived a total of 962 years, and then he died."
    },
    {
        "verse_number": "20",
        "text": ""
    },
    {
        "verse_number": "21",
        "text": "21When Enoch had lived 65 years, he became the father of Methuselah."
    },
    {
        "verse_number": "22",
        "text": "22After he became the father of Methuselah, Enoch walked faithfully with God 300 years and had other sons and daughters."
    },
    {
        "verse_number": "23",
        "text": "23Altogether, Enoch lived a total of 365 years."
    },
    {
        "verse_number": "24",
        "text": "24Enoch walked faithfully with God; then he was no more, because God took him away."
    },
    {
        "verse_number": "24",
        "text": ""
    },
    {
        "verse_number": "25",
        "text": "25When Methuselah had lived 187 years, he became the father of Lamech."
    },
    {
        "verse_number": "26",
        "text": "26After he became the father of Lamech, Methuselah lived 782 years and had other sons and daughters."
    },
    {
        "verse_number": "27",
        "text": "27Altogether, Methuselah lived a total of 969 years, and then he died."
    },
    {
        "verse_number": "27",
        "text": ""
    },
    {
        "verse_number": "28",
        "text": "28When Lamech had lived 182 years, he had a son."
    },
    {
        "verse_number": "29",
        "text": "29He named him Noah#5:29 Noah sounds like the Hebrew for comfort. and said, “He will comfort us in the labor and painful toil of our hands caused by the ground the Lord has cursed.”"
    },
    {
        "verse_number": "30",
        "text": "30After Noah was born, Lamech lived 595 years and had other sons and daughters."
    },
    {
        "verse_number": "31",
        "text": "31Altogether, Lamech lived a total of 777 years, and then he died."
    },
    {
        "verse_number": "31",
        "text": ""
    },
    {
        "verse_number": "32",
        "text": "32After Noah was 500 years old, he became the father of Shem, Ham and Japheth."
    }
]