[
    {
        "verse_number": "1",
        "text": "1Then Jacob continued on his journey and came to the land of the eastern peoples."
    },
    {
        "verse_number": "2",
        "text": "2There he saw a well in the open country, with three flocks of sheep lying near it because the flocks were watered from that well. The stone over the mouth of the well was large."
    },
    {
        "verse_number": "3",
        "text": "3When all the flocks were gathered there, the shepherds would roll the stone away from the well’s mouth and water the sheep. Then they would return the stone to its place over the mouth of the well."
    },
    {
        "verse_number": "3",
        "text": ""
    },
    {
        "verse_number": "4",
        "text": "4Jacob asked the shepherds, “My brothers, where are you from?”"
    },
    {
        "verse_number": "4",
        "text": "“We’re from Harran,” they replied."
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5He said to them, “Do you know Laban, Nahor’s grandson?”"
    },
    {
        "verse_number": "5",
        "text": "“Yes, we know him,” they answered."
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6Then Jacob asked them, “Is he well?”"
    },
    {
        "verse_number": "6",
        "text": "“Yes, he is,” they said, “and here comes his daughter Rachel with the sheep.”"
    },
    {
        "verse_number": "6",
        "text": ""
    },
    {
        "verse_number": "7",
        "text": "7“Look,” he said, “the sun is still high; it is not time for the flocks to be gathered. Water the sheep and take them back to pasture.”"
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8“We can’t,” they replied, “until all the flocks are gathered and the stone has been rolled away from the mouth of the well. Then we will water the sheep.”"
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9While he was still talking with them, Rachel came with her father’s sheep, for she was a shepherd."
    },
    {
        "verse_number": "10",
        "text": "10When Jacob saw Rachel daughter of his uncle Laban, and Laban’s sheep, he went over and rolled the stone away from the mouth of the well and watered his uncle’s sheep."
    },
    {
        "verse_number": "11",
        "text": "11Then Jacob kissed Rachel and began to weep aloud."
    },
    {
        "verse_number": "12",
        "text": "12He had told Rachel that he was a relative of her father and a son of Rebekah. So she ran and told her father."
    },
    {
        "verse_number": "12",
        "text": ""
    },
    {
        "verse_number": "13",
        "text": "13As soon as Laban heard the news about Jacob, his sister’s son, he hurried to meet him. He embraced him and kissed him and brought him to his home, and there Jacob told him all these things."
    },
    {
        "verse_number": "14",
        "text": "14Then Laban said to him, “You are my own flesh and blood.”"
    },
    {
        "verse_number": "14",
        "text": "After Jacob had stayed with him for a whole month,"
    },
    {
        "verse_number": "15",
        "text": "15Laban said to him, “Just because you are a relative of mine, should you work for me for nothing? Tell me what your wages should be.”"
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16Now Laban had two daughters; the name of the older was Leah, and the name of the younger was Rachel."
    },
    {
        "verse_number": "17",
        "text": "17Leah had weak#29:17 Or delicate eyes, but Rachel had a lovely figure and was beautiful."
    },
    {
        "verse_number": "18",
        "text": "18Jacob was in love with Rachel and said, “I’ll work for you seven years in return for your younger daughter Rachel.”"
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19Laban said, “It’s better that I give her to you than to some other man. Stay here with me.”"
    },
    {
        "verse_number": "20",
        "text": "20So Jacob served seven years to get Rachel, but they seemed like only a few days to him because of his love for her."
    },
    {
        "verse_number": "20",
        "text": ""
    },
    {
        "verse_number": "21",
        "text": "21Then Jacob said to Laban, “Give me my wife. My time is completed, and I want to make love to her.”"
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22So Laban brought together all the people of the place and gave a feast."
    },
    {
        "verse_number": "23",
        "text": "23But when evening came, he took his daughter Leah and brought her to Jacob, and Jacob made love to her."
    },
    {
        "verse_number": "24",
        "text": "24And Laban gave his servant Zilpah to his daughter as her attendant."
    },
    {
        "verse_number": "24",
        "text": ""
    },
    {
        "verse_number": "25",
        "text": "25When morning came, there was Leah! So Jacob said to Laban, “What is this you have done to me? I served you for Rachel, didn’t I? Why have you deceived me?”"
    },
    {
        "verse_number": "25",
        "text": ""
    },
    {
        "verse_number": "26",
        "text": "26Laban replied, “It is not our custom here to give the younger daughter in marriage before the older one."
    },
    {
        "verse_number": "27",
        "text": "27Finish this daughter’s bridal week; then we will give you the younger one also, in return for another seven years of work.”"
    },
    {
        "verse_number": "27",
        "text": ""
    },
    {
        "verse_number": "28",
        "text": "28And Jacob did so. He finished the week with Leah, and then Laban gave him his daughter Rachel to be his wife."
    },
    {
        "verse_number": "29",
        "text": "29Laban gave his servant Bilhah to his daughter Rachel as her attendant."
    },
    {
        "verse_number": "30",
        "text": "30Jacob made love to Rachel also, and his love for Rachel was greater than his love for Leah. And he worked for Laban another seven years."
    },
    {
        "verse_number": "30",
        "text": ""
    },
    {
        "verse_number": "31",
        "text": "31When the Lord saw that Leah was not loved, he enabled her to conceive, but Rachel remained childless."
    },
    {
        "verse_number": "32",
        "text": "32Leah became pregnant and gave birth to a son. She named him Reuben,#29:32 Reuben sounds like the Hebrew for he has seen my misery; the name means see, a son. for she said, “It is because the Lord has seen my misery. Surely my husband will love me now.”"
    },
    {
        "verse_number": "32",
        "text": ""
    },
    {
        "verse_number": "33",
        "text": "33She conceived again, and when she gave birth to a son she said, “Because the Lord heard that I am not loved, he gave me this one too.” So she named him Simeon.#29:33 Simeon probably means one who hears."
    },
    {
        "verse_number": "33",
        "text": ""
    },
    {
        "verse_number": "34",
        "text": "34Again she conceived, and when she gave birth to a son she said, “Now at last my husband will become attached to me, because I have borne him three sons.” So he was named Levi.#29:34 Levi sounds like and may be derived from the Hebrew for attached."
    },
    {
        "verse_number": "34",
        "text": ""
    },
    {
        "verse_number": "35",
        "text": "35She conceived again, and when she gave birth to a son she said, “This time I will praise the Lord.” So she named him Judah.#29:35 Judah sounds like and may be derived from the Hebrew for praise. Then she stopped having children."
    }
]