[
    {
        "verse_number": "1",
        "text": "1The Lord had said to Abram, “Go from your country, your people and your father’s household to the land I will show you."
    },
    {
        "verse_number": "1",
        "text": ""
    },
    {
        "verse_number": "2",
        "text": "2“I will make you into a great nation,"
    },
    {
        "verse_number": "2",
        "text": "and I will bless you;"
    },
    {
        "verse_number": "2",
        "text": "I will make your name great,"
    },
    {
        "verse_number": "2",
        "text": "and you will be a blessing.#12:2 Or be seen as blessed"
    },
    {
        "verse_number": "2",
        "text": ""
    },
    {
        "verse_number": "3",
        "text": "3I will bless those who bless you,"
    },
    {
        "verse_number": "3",
        "text": "and whoever curses you I will curse;"
    },
    {
        "verse_number": "3",
        "text": "and all peoples on earth"
    },
    {
        "verse_number": "3",
        "text": "will be blessed through you.”#12:3 Or earth / will use your name in blessings (see 48:20)"
    },
    {
        "verse_number": "3",
        "text": ""
    },
    {
        "verse_number": "4",
        "text": "4So Abram went, as the Lord had told him; and Lot went with him. Abram was seventy-five years old when he set out from Harran."
    },
    {
        "verse_number": "5",
        "text": "5He took his wife Sarai, his nephew Lot, all the possessions they had accumulated and the people they had acquired in Harran, and they set out for the land of Canaan, and they arrived there."
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6Abram traveled through the land as far as the site of the great tree of Moreh at Shechem. At that time the Canaanites were in the land."
    },
    {
        "verse_number": "7",
        "text": "7The Lord appeared to Abram and said, “To your offspring#12:7 Or seed I will give this land.” So he built an altar there to the Lord, who had appeared to him."
    },
    {
        "verse_number": "7",
        "text": ""
    },
    {
        "verse_number": "8",
        "text": "8From there he went on toward the hills east of Bethel and pitched his tent, with Bethel on the west and Ai on the east. There he built an altar to the Lord and called on the name of the Lord."
    },
    {
        "verse_number": "8",
        "text": ""
    },
    {
        "verse_number": "9",
        "text": "9Then Abram set out and continued toward the Negev."
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10Now there was a famine in the land, and Abram went down to Egypt to live there for a while because the famine was severe."
    },
    {
        "verse_number": "11",
        "text": "11As he was about to enter Egypt, he said to his wife Sarai, “I know what a beautiful woman you are."
    },
    {
        "verse_number": "12",
        "text": "12When the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live."
    },
    {
        "verse_number": "13",
        "text": "13Say you are my sister, so that I will be treated well for your sake and my life will be spared because of you.”"
    },
    {
        "verse_number": "13",
        "text": ""
    },
    {
        "verse_number": "14",
        "text": "14When Abram came to Egypt, the Egyptians saw that Sarai was a very beautiful woman."
    },
    {
        "verse_number": "15",
        "text": "15And when Pharaoh’s officials saw her, they praised her to Pharaoh, and she was taken into his palace."
    },
    {
        "verse_number": "16",
        "text": "16He treated Abram well for her sake, and Abram acquired sheep and cattle, male and female donkeys, male and female servants, and camels."
    },
    {
        "verse_number": "16",
        "text": ""
    },
    {
        "verse_number": "17",
        "text": "17But the Lord inflicted serious diseases on Pharaoh and his household because of Abram’s wife Sarai."
    },
    {
        "verse_number": "18",
        "text": "18So Pharaoh summoned Abram. “What have you done to me?” he said. “Why didn’t you tell me she was your wife?"
    },
    {
        "verse_number": "19",
        "text": "19Why did you say, ‘She is my sister,’ so that I took her to be my wife? Now then, here is your wife. Take her and go!”"
    },
    {
        "verse_number": "20",
        "text": "20Then Pharaoh gave orders about Abram to his men, and they sent him on his way, with his wife and everything he had."
    }
]