[
    {
        "verse_number": "1",
        "text": "1So Isaac called for Jacob and blessed him. Then he commanded him: “Do not marry a Canaanite woman."
    },
    {
        "verse_number": "2",
        "text": "2Go at once to Paddan Aram,#28:2 That is, Northwest Mesopotamia; also in verses 5, 6 and 7 to the house of your mother’s father Bethuel. Take a wife for yourself there, from among the daughters of Laban, your mother’s brother."
    },
    {
        "verse_number": "3",
        "text": "3May God Almighty#28:3 Hebrew El-Shaddai bless you and make you fruitful and increase your numbers until you become a community of peoples."
    },
    {
        "verse_number": "4",
        "text": "4May he give you and your descendants the blessing given to Abraham, so that you may take possession of the land where you now reside as a foreigner, the land God gave to Abraham.”"
    },
    {
        "verse_number": "5",
        "text": "5Then Isaac sent Jacob on his way, and he went to Paddan Aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau."
    },
    {
        "verse_number": "5",
        "text": ""
    },
    {
        "verse_number": "6",
        "text": "6Now Esau learned that Isaac had blessed Jacob and had sent him to Paddan Aram to take a wife from there, and that when he blessed him he commanded him, “Do not marry a Canaanite woman,”"
    },
    {
        "verse_number": "7",
        "text": "7and that Jacob had obeyed his father and mother and had gone to Paddan Aram."
    },
    {
        "verse_number": "8",
        "text": "8Esau then realized how displeasing the Canaanite women were to his father Isaac;"
    },
    {
        "verse_number": "9",
        "text": "9so he went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Ishmael son of Abraham, in addition to the wives he already had."
    },
    {
        "verse_number": "9",
        "text": ""
    },
    {
        "verse_number": "10",
        "text": "10Jacob left Beersheba and set out for Harran."
    },
    {
        "verse_number": "11",
        "text": "11When he reached a certain place, he stopped for the night because the sun had set. Taking one of the stones there, he put it under his head and lay down to sleep."
    },
    {
        "verse_number": "12",
        "text": "12He had a dream in which he saw a stairway resting on the earth, with its top reaching to heaven, and the angels of God were ascending and descending on it."
    },
    {
        "verse_number": "13",
        "text": "13There above it#28:13 Or There beside him stood the Lord, and he said: “I am the Lord, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you are lying."
    },
    {
        "verse_number": "14",
        "text": "14Your descendants will be like the dust of the earth, and you will spread out to the west and to the east, to the north and to the south. All peoples on earth will be blessed through you and your offspring.#28:14 Or will use your name and the name of your offspring in blessings (see 48:20)"
    },
    {
        "verse_number": "15",
        "text": "15I am with you and will watch over you wherever you go, and I will bring you back to this land. I will not leave you until I have done what I have promised you.”"
    },
    {
        "verse_number": "15",
        "text": ""
    },
    {
        "verse_number": "16",
        "text": "16When Jacob awoke from his sleep, he thought, “Surely the Lord is in this place, and I was not aware of it.”"
    },
    {
        "verse_number": "17",
        "text": "17He was afraid and said, “How awesome is this place! This is none other than the house of God; this is the gate of heaven.”"
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18Early the next morning Jacob took the stone he had placed under his head and set it up as a pillar and poured oil on top of it."
    },
    {
        "verse_number": "19",
        "text": "19He called that place Bethel,#28:19 Bethel means house of God. though the city used to be called Luz."
    },
    {
        "verse_number": "19",
        "text": ""
    },
    {
        "verse_number": "20",
        "text": "20Then Jacob made a vow, saying, “If God will be with me and will watch over me on this journey I am taking and will give me food to eat and clothes to wear"
    },
    {
        "verse_number": "21",
        "text": "21so that I return safely to my father’s household, then the Lord#28:20,21 Or Since God… father’s household, the Lord will be my God"
    },
    {
        "verse_number": "22",
        "text": "22and#28:21,22 Or household, and the Lord will be my God, 22 then this stone that I have set up as a pillar will be God’s house, and of all that you give me I will give you a tenth.”"
    }
]