[
    {
        "verse_number": "1",
        "text": "1When Isaac was old and his eyes were so weak that he could no longer see, he called for Esau his older son and said to him, “My son.”"
    },
    {
        "verse_number": "1",
        "text": "“Here I am,” he answered."
    },
    {
        "verse_number": "1",
        "text": ""
    },
    {
        "verse_number": "2",
        "text": "2Isaac said, “I am now an old man and don’t know the day of my death."
    },
    {
        "verse_number": "3",
        "text": "3Now then, get your equipment—your quiver and bow—and go out to the open country to hunt some wild game for me."
    },
    {
        "verse_number": "4",
        "text": "4Prepare me the kind of tasty food I like and bring it to me to eat, so that I may give you my blessing before I die.”"
    },
    {
        "verse_number": "4",
        "text": ""
    },
    {
        "verse_number": "5",
        "text": "5Now Rebekah was listening as Isaac spoke to his son Esau. When Esau left for the open country to hunt game and bring it back,"
    },
    {
        "verse_number": "6",
        "text": "6Rebekah said to her son Jacob, “Look, I overheard your father say to your brother Esau,"
    },
    {
        "verse_number": "7",
        "text": "7‘Bring me some game and prepare me some tasty food to eat, so that I may give you my blessing in the presence of the Lord before I die.’"
    },
    {
        "verse_number": "8",
        "text": "8Now, my son, listen carefully and do what I tell you:"
    },
    {
        "verse_number": "9",
        "text": "9Go out to the flock and bring me two choice young goats, so I can prepare some tasty food for your father, just the way he likes it."
    },
    {
        "verse_number": "10",
        "text": "10Then take it to your father to eat, so that he may give you his blessing before he dies.”"
    },
    {
        "verse_number": "10",
        "text": ""
    },
    {
        "verse_number": "11",
        "text": "11Jacob said to Rebekah his mother, “But my brother Esau is a hairy man while I have smooth skin."
    },
    {
        "verse_number": "12",
        "text": "12What if my father touches me? I would appear to be tricking him and would bring down a curse on myself rather than a blessing.”"
    },
    {
        "verse_number": "12",
        "text": ""
    },
    {
        "verse_number": "13",
        "text": "13His mother said to him, “My son, let the curse fall on me. Just do what I say; go and get them for me.”"
    },
    {
        "verse_number": "13",
        "text": ""
    },
    {
        "verse_number": "14",
        "text": "14So he went and got them and brought them to his mother, and she prepared some tasty food, just the way his father liked it."
    },
    {
        "verse_number": "15",
        "text": "15Then Rebekah took the best clothes of Esau her older son, which she had in the house, and put them on her younger son Jacob."
    },
    {
        "verse_number": "16",
        "text": "16She also covered his hands and the smooth part of his neck with the goatskins."
    },
    {
        "verse_number": "17",
        "text": "17Then she handed to her son Jacob the tasty food and the bread she had made."
    },
    {
        "verse_number": "17",
        "text": ""
    },
    {
        "verse_number": "18",
        "text": "18He went to his father and said, “My father.”"
    },
    {
        "verse_number": "18",
        "text": "“Yes, my son,” he answered. “Who is it?”"
    },
    {
        "verse_number": "18",
        "text": ""
    },
    {
        "verse_number": "19",
        "text": "19Jacob said to his father, “I am Esau your firstborn. I have done as you told me. Please sit up and eat some of my game, so that you may give me your blessing.”"
    },
    {
        "verse_number": "19",
        "text": ""
    },
    {
        "verse_number": "20",
        "text": "20Isaac asked his son, “How did you find it so quickly, my son?”"
    },
    {
        "verse_number": "20",
        "text": "“The Lord your God gave me success,” he replied."
    },
    {
        "verse_number": "20",
        "text": ""
    },
    {
        "verse_number": "21",
        "text": "21Then Isaac said to Jacob, “Come near so I can touch you, my son, to know whether you really are my son Esau or not.”"
    },
    {
        "verse_number": "21",
        "text": ""
    },
    {
        "verse_number": "22",
        "text": "22Jacob went close to his father Isaac, who touched him and said, “The voice is the voice of Jacob, but the hands are the hands of Esau.”"
    },
    {
        "verse_number": "23",
        "text": "23He did not recognize him, for his hands were hairy like those of his brother Esau; so he proceeded to bless him."
    },
    {
        "verse_number": "24",
        "text": "24“Are you really my son Esau?” he asked."
    },
    {
        "verse_number": "24",
        "text": "“I am,” he replied."
    },
    {
        "verse_number": "24",
        "text": ""
    },
    {
        "verse_number": "25",
        "text": "25Then he said, “My son, bring me some of your game to eat, so that I may give you my blessing.”"
    },
    {
        "verse_number": "25",
        "text": "Jacob brought it to him and he ate; and he brought some wine and he drank."
    },
    {
        "verse_number": "26",
        "text": "26Then his father Isaac said to him, “Come here, my son, and kiss me.”"
    },
    {
        "verse_number": "26",
        "text": ""
    },
    {
        "verse_number": "27",
        "text": "27So he went to him and kissed him. When Isaac caught the smell of his clothes, he blessed him and said,"
    },
    {
        "verse_number": "27",
        "text": "“Ah, the smell of my son"
    },
    {
        "verse_number": "27",
        "text": "is like the smell of a field"
    },
    {
        "verse_number": "27",
        "text": "that the Lord has blessed."
    },
    {
        "verse_number": "27",
        "text": ""
    },
    {
        "verse_number": "28",
        "text": "28May God give you heaven’s dew"
    },
    {
        "verse_number": "28",
        "text": "and earth’s richness—"
    },
    {
        "verse_number": "28",
        "text": "an abundance of grain and new wine."
    },
    {
        "verse_number": "28",
        "text": ""
    },
    {
        "verse_number": "29",
        "text": "29May nations serve you"
    },
    {
        "verse_number": "29",
        "text": "and peoples bow down to you."
    },
    {
        "verse_number": "29",
        "text": "Be lord over your brothers,"
    },
    {
        "verse_number": "29",
        "text": "and may the sons of your mother bow down to you."
    },
    {
        "verse_number": "29",
        "text": "May those who curse you be cursed"
    },
    {
        "verse_number": "29",
        "text": "and those who bless you be blessed.”"
    },
    {
        "verse_number": "29",
        "text": ""
    },
    {
        "verse_number": "30",
        "text": "30After Isaac finished blessing him, and Jacob had scarcely left his father’s presence, his brother Esau came in from hunting."
    },
    {
        "verse_number": "31",
        "text": "31He too prepared some tasty food and brought it to his father. Then he said to him, “My father, please sit up and eat some of my game, so that you may give me your blessing.”"
    },
    {
        "verse_number": "31",
        "text": ""
    },
    {
        "verse_number": "32",
        "text": "32His father Isaac asked him, “Who are you?”"
    },
    {
        "verse_number": "32",
        "text": "“I am your son,” he answered, “your firstborn, Esau.”"
    },
    {
        "verse_number": "32",
        "text": ""
    },
    {
        "verse_number": "33",
        "text": "33Isaac trembled violently and said, “Who was it, then, that hunted game and brought it to me? I ate it just before you came and I blessed him—and indeed he will be blessed!”"
    },
    {
        "verse_number": "33",
        "text": ""
    },
    {
        "verse_number": "34",
        "text": "34When Esau heard his father’s words, he burst out with a loud and bitter cry and said to his father, “Bless me—me too, my father!”"
    },
    {
        "verse_number": "34",
        "text": ""
    },
    {
        "verse_number": "35",
        "text": "35But he said, “Your brother came deceitfully and took your blessing.”"
    },
    {
        "verse_number": "35",
        "text": ""
    },
    {
        "verse_number": "36",
        "text": "36Esau said, “Isn’t he rightly named Jacob#27:36 Jacob means he grasps the heel, a Hebrew idiom for he takes advantage of or he deceives.? This is the second time he has taken advantage of me: He took my birthright, and now he’s taken my blessing!” Then he asked, “Haven’t you reserved any blessing for me?”"
    },
    {
        "verse_number": "36",
        "text": ""
    },
    {
        "verse_number": "37",
        "text": "37Isaac answered Esau, “I have made him lord over you and have made all his relatives his servants, and I have sustained him with grain and new wine. So what can I possibly do for you, my son?”"
    },
    {
        "verse_number": "37",
        "text": ""
    },
    {
        "verse_number": "38",
        "text": "38Esau said to his father, “Do you have only one blessing, my father? Bless me too, my father!” Then Esau wept aloud."
    },
    {
        "verse_number": "38",
        "text": ""
    },
    {
        "verse_number": "39",
        "text": "39His father Isaac answered him,"
    },
    {
        "verse_number": "39",
        "text": "“Your dwelling will be"
    },
    {
        "verse_number": "39",
        "text": "away from the earth’s richness,"
    },
    {
        "verse_number": "39",
        "text": "away from the dew of heaven above."
    },
    {
        "verse_number": "39",
        "text": ""
    },
    {
        "verse_number": "40",
        "text": "40You will live by the sword"
    },
    {
        "verse_number": "40",
        "text": "and you will serve your brother."
    },
    {
        "verse_number": "40",
        "text": "But when you grow restless,"
    },
    {
        "verse_number": "40",
        "text": "you will throw his yoke"
    },
    {
        "verse_number": "40",
        "text": "from off your neck.”"
    },
    {
        "verse_number": "40",
        "text": ""
    },
    {
        "verse_number": "41",
        "text": "41Esau held a grudge against Jacob because of the blessing his father had given him. He said to himself, “The days of mourning for my father are near; then I will kill my brother Jacob.”"
    },
    {
        "verse_number": "41",
        "text": ""
    },
    {
        "verse_number": "42",
        "text": "42When Rebekah was told what her older son Esau had said, she sent for her younger son Jacob and said to him, “Your brother Esau is planning to avenge himself by killing you."
    },
    {
        "verse_number": "43",
        "text": "43Now then, my son, do what I say: Flee at once to my brother Laban in Harran."
    },
    {
        "verse_number": "44",
        "text": "44Stay with him for a while until your brother’s fury subsides."
    },
    {
        "verse_number": "45",
        "text": "45When your brother is no longer angry with you and forgets what you did to him, I’ll send word for you to come back from there. Why should I lose both of you in one day?”"
    },
    {
        "verse_number": "45",
        "text": ""
    },
    {
        "verse_number": "46",
        "text": "46Then Rebekah said to Isaac, “I’m disgusted with living because of these Hittite women. If Jacob takes a wife from among the women of this land, from Hittite women like these, my life will not be worth living.”"
    }
]